[{
  "rated": "9",
  "out_of": "10",
  "userid": "rameshkumariimt",
  "helpfulness": "45 out of 51 found this helpful",
  "title": "Must watch",
  "comment": "A very well mixture of comedy and horror. Remarkable acting of all actors. I had to close my eyes at some point in the movie. Full package of entertainment."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "shardulneeraj",
  "helpfulness": "47 out of 54 found this helpful",
  "title": "Honest stree review",
  "comment": "One of the best Indian horror comedy movie i have ever seen.. director has justified the genre of the movie so beautifully..i must say i can watch it again.. apart from that Raj kumar rao again at his level best.. at the end it would confuse u little bit and u will discuss , and this what the director wants.. i would say 9/10. Plz watch and make a stress free moment of your life"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "dpshrs",
  "helpfulness": "29 out of 34 found this helpful",
  "title": "One of the most original movie of 2018",
  "comment": "BEST HORROR COMEDY FILM AFTER BHOOL BHULAIYAA!! If that comment isn't enough to explain the film then i don't know what'll be..."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "nsanjay-76795",
  "helpfulness": "29 out of 34 found this helpful",
  "title": "Terrific In Madcap Film",
  "comment": "A zany supernatural parable that is both strongly feminist and uproariously funny, Stree, Amar Kaushik's self-assured first feature, delivers shocks and laughs in equal measure. Despite its repeated to-ing and fro-ing between conflicting tones, the horror comedy glides along a firm and steady arc almost all through its runtime of two hours and a bit.\n\nThe film's fear quotient, like its comic flourishes, varies pretty wildly - in the climatic moments, it even wobbles just a touch - but the sight of fully grown men cowering in panic at the very mention of the spectral figure who gives the film its title is always hilarious, even when it tilts towards the terrifying."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "sharmaakshat-63166",
  "helpfulness": "21 out of 25 found this helpful",
  "title": "Talent bhar bhar k",
  "comment": "A very good combination of horror+comedy. Beautiful direction and tremendous acting by raj kumar rao and mr. Tripathi Both of them made the movie exceptional"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "anshusinha-89354",
  "helpfulness": "14 out of 16 found this helpful",
  "title": "Full Entertainment.",
  "comment": "Complete package of Horror-comedy,superb acting and brilliant one to watch for entertainment. The movie gives you outstanding performance by full starcast,the comedy and horror mixture is fabulous. Go watch it!"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "znazizn",
  "helpfulness": "10 out of 11 found this helpful",
  "title": "Scariest > funniest",
  "comment": "Great works by all performers. Soundtrack too good"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "nikhilsharma-05528",
  "helpfulness": "13 out of 15 found this helpful",
  "title": "Nice concept with full on entertainment",
  "comment": "For me Stree is worth watching as i have really enjoyed the show.Rajkumar Rao and Pankaj Tripathi again proved themselves as great actors.Though as a viewer i left theatre with so many question marks because at the end you have to use your brain and connect yourself with the story as why this happened and why that happened.But the concept is quite different and i am sure i have never seen anything like this before in bollywood. As in the thought of making a mixture of horror with comedy and then ending with a beautiful message which is actually the wow factor of the movie deserves an applause.Great work Team STREE."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "mahmudbah-39602",
  "helpfulness": "13 out of 15 found this helpful",
  "title": "A horror movie or a comedy?",
  "comment": "Can't really tell because both of the genre's was perfectly used in the movie. which makes it awesome and worth your every bit of your money. A must See movie this year."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "magow-01",
  "helpfulness": "9 out of 13 found this helpful",
  "title": "Review Stree Movie",
  "comment": ""
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "coolamitu-35545",
  "helpfulness": "9 out of 13 found this helpful",
  "title": "Nice movie",
  "comment": "Shardha kapoor looks sexy and cool as usual and rao doing well and all star in this movie play awesome..."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "sanjubhat",
  "helpfulness": "6 out of 8 found this helpful",
  "title": "Stree ( A ridiculously good film !!)",
  "comment": "Story : The story is set in a small town called Chanderi in MP which is supposedly haunted by an angry female spirit which targets only men during four days of an annual religious festival held there. Whether it is actually a spirit or just an urban legend is the mystery element in the film. Bicky (Rajkumar Rao), the protagonist is the best ladies tailor in town, one who can take measurements of ladies by just glancing at them. He and his \"velha\" friends Bittu (Aparshakti Khurana) and Jana (Abhishek Bannerjee) get involved in this whole mystery when Bicky meets a mysterious girl Shraddha Kapoor who only comes to Chanderi during the four days of the festival. As men start disappearing from Chanderi, it is upto these three friends along with a bumbling param gyaani Rudra (Pankaj Tripathi) to unravel the mystery.\n\nReview: This is a unique film totally unlike usual horror flicks as it combines multiple genres like comedy, horror & dark humour which is not commonly seen. The blending of comedy in between the horror storyline is perfect and does not look outlandish. It however tones down the impact of the scary scenes. Having said that, the film has its scary moments which are the result of great visual and sound effects. \n\nCasting: The casting is perfect with the three friends along with the bumbling Pankaj Tripathi providing most of the laughs. Shraddha Kapoor provides the mystery element to the storyline as she conveys both innocence and well as a sinister mind at play effectively. Rao and Tripathi are the scene stealers who breeze through their parts with ease. This is a film from Dinesh Vijan's Maddock Films, the makers of the zombie flick Go Goa Gone and they genuinely succeed in making a different film by combining multiple genres without diluting the essence or making the film look tacky.\n\nMy Verdict : If you have liked GO Goa Gone , you will definitely like this one. 8 out of 10 from me for this ridiculously genuine attempt by Maddock films at attempting to make something different."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "arpitraul-90955",
  "helpfulness": "5 out of 7 found this helpful",
  "title": "Rajkumar Aparshakti and their freind was excellent in their roles",
  "comment": "Excellent movie Rajkumar Rao is the nestbbig thing . Excellent story , unexpected twists and great dialogues"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "brij-raychanda",
  "helpfulness": "2 out of 2 found this helpful",
  "title": "Decent Comedy+Horror movie with Witty dialogues & tight script.",
  "comment": "From concept itself one feel it should be interesting. Comedy+horror. And it was interesting one.\n\nOne of the best movie of this year. And best of year in comic genre till now. Everything in movie was just perfect. Story, Screenplay, performances, Direction, Music, Dialogues.\n\nRajkumar rao as always did his best. Surprisingly first time I liked performance of Shraddha also. All supporting cast was also done fabulous job.\n\nFunny and quirky dialogues take the movie at such high level.\n\nWhen name of Duo Raj & DK is there then such movie never disappoints. (Exlude gentlemen movie).\n\nAfter long time watched such decent comic movie."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "mishravasuexam",
  "helpfulness": "2 out of 3 found this helpful",
  "title": "Great combination of comedy and horror...",
  "comment": "Good acting by all cast members. Worth watching it."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shibendradas",
  "helpfulness": "2 out of 3 found this helpful",
  "title": "Fantastic movie!!! Dont miss",
  "comment": "RAJKUMAR RAO as usual awesome acting. sharaddha nice appearance.\n\npankaj tripathi is a multi talented actor. and rest actor acting is also fabulous."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "TanayCH",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Stree - A (Wo)man's Hor-Com",
  "comment": "Comedy, as said, is a serious business. Therefore, 'horror-comedy' in its 'thrills' and 'tickles' may be considered a feat of its own.\n\nEnough with the definitions; but actually, that's where all the fun begins. Based on the early 2000's \"Nale Ba\" mysteries ('come tomorrow' in Kannada), we're introduced to a ridiculously true phenomenon - the fable of \"Stree\" (here 'the ghost-lady'). The spirit fearfully haunts the sub-urban town of Chanderi during a festival every year. The simple townsfolk paint \" O Stree, Kall Aana!\" outside their homes to protect exclusively their young men from the ghastly abductions.\n\nEnter - an uber-good looking ladies tailor (Rajkummar Rao \"Newton\") who in his pursuit of one, true-calling falls for a mysterious looking lady customer (Shraddha Kapoor \"ABCD 2\"). Enter his 2 friends (Aparshakti Khuraana \"Dangal\" and Abhishek Bannerjee \"TVF Pitchers\") - who half-doubt and half-worry over their lover-boy's new found lady. Come along a Pundit ji (a \"paranologist\" - dealing in macabre and historical paranormal tales; played by Pankaj Tripathi \"Newton\") who spreads free-knowledge to the spooked-up on ways of avoiding Stree.\n\nWandering plot so far, isn't it? As those abductions continue these characters come together to attempt saving all from Stree - who by now means \"serious business\" (pun and no-pun intended). Whilst digging deep with them, we come across more sinister reasons behind the origins and the doom of \"warring the witch.\"\n\nIn its humble clumsiness, \"Stree\" is smart-entertainer throughout. Dialogues (Sumit Arora \"24\") and the Direction (debutant Amar Kaushik) work a lethal combo in making its sequences ROFL funny and genuinely scary. Though, the film on a whole lacks tempo, often deliberating with its excellently casted ensemble (Shiv Chauhan and Ashish Khare \"Daddy\") but underuses its characters barring the leading man. There are carefully written scenes for highlighting all the good, but not enough to cover plot-predictability and unreasonable filler portions.\n\nThankfully, the narrative manages to keep one curious enough for the next. The music and songs (including promo-chartbusters such as \"Aao Kabhi Haveli Pe\" and the beautifully lyricized but, underappreciated \"Dill ka Darzi\") are passable; however, the film certainly isn't. Amidst liberal usage of innuendoes along with subtle adult-humour, the film surprisingly emerges as a \"mass/family entertainer\". So, it hurts a little to say that \"Stree\" might have been an A-list \"hor-com\" film.\n\nFor the ones who haven't yet watched it, could look forward to a balance between slapstick and old-school humour. A value-for-money, 2 hours of enjoyable theatre-time. Going with 7/10."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "anshumanhasurkar",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "The best Comedy-Horror movie... Must Watch 200%",
  "comment": "Can you imagine that you can actually laugh in a horror movie? Well yes, I did, a lot. Great screenplay, very well written script & best direction. The best acting by Raj Kumar Rao till date. A complete \"paisa vasool\" movie."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "raghavmehra-68403",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Awesome",
  "comment": "Best hindi movie this year so far...you will be laughing all through"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shobhitgarg-00602",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Superb Movie",
  "comment": "Hello i am shobhit garg, heree is my experience of watching \n\nstree movie is good. the whole is good first part movie is \n\nfull on comedy after lunch movie is little comedy and full \n\nof horror. all the character's acting is superb. but the end \n\nis mytrious you are not realize who is streee?"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "shishirbharti-54",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Not a horror movie.",
  "comment": "Amazing acting performances overall except one. Screenplay and writing is the major plus point of the movie, as an horror movie little bit low budget in terms of special effects. As a comedy one of the best original screenplay movie of the year."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "paramjeetgusain",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Best movie of 2018 for sure.",
  "comment": "Horror+comedy+rajkumar rao=blockbuster movie. One of the best movie I ever watched.trust me stree is one of the best horror comedy in world cinema."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "gannu2489",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Simplest Review: One of the best peices of Cinema.",
  "comment": "Original concept, executed right. Perfect definition of a Horror Comedy.\n\nYou will get scared and burst into laughter at the same time. Its not just a mindless or gory comedy, and its far better than hollywood crap we have seen in the name of horror comedies.\n\nThe third theme it hits is women's respect in our society, which is very well blended with the other two.\n\nActors are spot on, and all of them fit themselves in a perfect place. Trend is changing now, young India wants better acting and story, not just pretty faces.\n\nOnly negative I feel is the item number, which could have been avoided. But I choose to give extra credits for a Vijay Raaz's cameo, that nullifies Noora's kamariya.\n\nWatch it to have fun, and learn something on India Cinema."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "anchalverma-23512",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Awesome movie",
  "comment": "Amazing movie...every one should watch this beautiful movie.."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "saurabhjain_sj",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "All out entertainer",
  "comment": "One of the best movies I have seen in a while. Superb acting by all the lead and supporting actors. Don't miss at any cost"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "vikhayatsharma66",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Must watch",
  "comment": "After such a long time we got a horror comady which we"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "nvdkhan",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Unique storyline in history of bollywood.",
  "comment": "Must watch, thrilling, romantic, Horror combination movie."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "mk-88780",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "It is a refreshing Bollywood film that mixes horror and comedy.",
  "comment": ""
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ankitavrm60",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Treat for Horror Genre Lovers",
  "comment": "Indian Horror Genre has achieved a new level thanks to the makers of \"Stree\". I have always loved good suspense and thriller flicks and \"Stree\" has successfully captured all these elements. Powerful Background score! And the story of the movie takes me back to the time when we all children used to listen to bedtime horror stories of witches & ghosts. \n\nI loved Rajkumar Rao, Pankaj Tripathi, Abhishek, Aparshakti in the movie. They were just so natural. \n\nOverall I rate it 9!!! Keep up the good work."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "ravysharma96-828-231604",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Good Film.",
  "comment": "Film is pretty good spooky sometimes and most of the time it is funny. Rajkumar Rao did a great job and other characters too. The movie is worth watching !"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "yashhjoshii",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "This movie has given Bollywood a new dimension!",
  "comment": "Bollywood has very few horror comedies and out of all Stree has to be the best! When I watched the trailer I had decided I have go n watch this cos it seemed different and I'm glad that stree didn't disappoint me. Writers have chosen different myths from different states of India to form the script of movie which certainly makes the movie very desi and enjoyable. If we talk about acting then hats off to Rajkumar Rao... seriously he is one gem of an actor! I have become a FAN The ending will confuse you and make you think a lot and that's what director wants cos there is a sequel to Stree which will begin from where the movie has ended. ITS A MUST BUT DON'T TAKE YOUR CHILDREN ALONG WITH YOU (if u have) It has converse and scene which can make you and your child uncomfortable.!"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "prithukvb",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Best horror comedy ever !!! \"sequel is required\"",
  "comment": "Let's enjoy this till next one Exciting, thrilled, surprised, mystery, comedy, romance perfect punch line and background score\n\n10/10 is only for very 1st attempt by bollywood on this genre"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "Archit-Kapoor",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Rajkumar Rao, take a bow! Must watch!",
  "comment": "This is an absolute treasure to watch; full on entertainment. Good picturization. Well written. And the classic acting of Rajkumar Rao will win your hearts. Wonderful humor. And besides, the movie carries a social message as well. Everything is put well together in this movie. The story is immensely hilarious. But the movie makes sure to make you realize that it has a horror element as well. Will keep you intrigued till the very last minute. You'll again become a fan of Rajkumar Rao. You really shouldn't miss out this movie. Worth every penny."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "goshsumit",
  "helpfulness": "1 out of 1 found this helpful",
  "title": "Awesome movie",
  "comment": "Must watch. Commendable acting by Rajkumaar Rao and Tripathi ji. You will feel relaxed after watching the movie. Its a weekend stress release movie"
}, {
  "rated": "5",
  "out_of": "10",
  "userid": "fillerruth",
  "helpfulness": "10 out of 30 found this helpful",
  "title": "A roller coaster experience. Impressive....",
  "comment": "STREE is based on folklore and a myth that has found acceptance in several states across India. Set in the Madhya Pradesh town of Chanderi, it tells the story of a bride's wandering spirit who roams the streets for four days during an annual pooja. She calls out to young, unsuspecting men, and if they turn back, she takes it as their acceptance to be with her. Vicky (Rajkummar Rao) is a gifted tailor in this town and he doesn't believe in this myth. On the first day of pooja, a mysterious young girl (Shraddha Kapoor) approaches him to design her ghagra. She shows interest in him romantically and Vicky falls for him. Vicky tells his friends Jana (Abhishek Banerjee) and Bittu (Aparshakti Khurana) about his love interest. Jana is happy for Vicky but Bittu cautions Vicky to be careful of her. Trouble arises when Bittu analyses the situation and realises that Vicky's love interest might be none other than Stree. What happens next forms the rest of the film.\n\nRaj Nidimoru, Krishna DK and Pawan Sony's story is based on a true phenomenon. They make great use of the plot as it's quite fresh and they add the necessary elements to make it better. Raj Nidimoru and Krishna DK's screenplay is very effective and entertaining. The film's duration is just right at 128 minutes and it keeps the audiences engaged. Sumit Aroraa's dialogues are hilarious and very witty. Few one liners are sure to bring the house down.\n\nAmar Kaushik's direction is commendable, considering that this is his first film. He has handled the horror as well as dramatic scenes with panache. However for a horror comedy, the film gets a bit too spooky. Hence, it might be a bit too much for the family audiences. Secondly it seems he rushed through the ending. The build up is excellent but then he finishes it in a jiffy. Also the final scene will confuse a section of audiences and they might come out of the theatre in daze.\n\nSTREE begins on a high and sets the eerie mood. Immediately then, the entry of Vicky, Bittu and Jana make things light hearted. The manner in which Vicky and the girl fall in love is sweet. However the horror sequences are also neatly inserted in between. The sequence where Narendra (Aakash Dabhade) gets taken away is quite scary. However the most chilling sequence of the first half is the pre-interval sequence. Post intermission, the oscillation between fun and horror continues well. But the interest drops a bit at this point. Also, the ending has its moments but it's also underwhelming and confusing.\n\nRajkummar Rao gets a chance to dabble in a new genre and he excels thoroughly. He genuinely gives an earnest performance and is a treat to see him getting spooked, delivering monologues and behaving madly in love. He is sure to bring the house down when he loses his cool in front of Jana and Stree. Also watch out for him in the second half sequence when he's trying to analyse Stree. He's terrific. Shraddha Kapoor delivers a fine performance and has a mysterious air about her as per the character's requirement. In the second half she gets better. Aparshakti Khurrana gives a great performance and he doesn't get overboard. Same goes for Abhishek Banerjee. In fact he's superb in the last one hour. Pankaj Tripathi is hardly there in the first half and he rocks big time in the second half. Vijay Raaz (Shastri) leaves a mark in the lone sequence. Flora Saini plays an important part with elan. Atul Srivastava (Vicky's father) brings the house down in the scene where he talks to Rajkummar Rao about sex. Nora Fatehi is sizzling in the item number.\n\nSachin-Jigar's music is entertaining. 'Darji' is peppy while 'Milegi Milegi' is the best of the lot but is played during the end credits. 'Kamariya' is entertaining while 'Nazar Na Lag Jaaye' is okay. 'Aao Kabhi Haveli Pe' is relegated to the background. Ketan Sodha's background score is excellent and enhances the eerie quotient significantly. However the sound quality at some places could have been better.\n\nAmalendu Chaudhary's cinematography is ideal and sans any vague camerawork that certain horror films often have in Bollywood. He also has shot the locales of Chanderi beautifully. Madhusudhan's production design is authentic. Manohar Verma and Gulzar Amin Khatib's action is nothing special. Prime Focus' VFX is upto the mark. Hemanti Sarkar's editing is simple and works well.\n\nOn the whole, STREE is a unique concoction of humour and horror that floors you completely. At the box office, this entertainer surely has a chance to tickle the audience's funny bone, send a chill down their spine and ultimately give them a roller coaster experience. Impressive!"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "syedreeebb",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "One of the best Indian horror comedy movie i have ever seen..",
  "comment": ""
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "shubhamsrivastavalu",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best Horror Comedy of my life",
  "comment": ""
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "kaushalmodi1985",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "'Stree' is flavored with mixing of Comedy & Horror.",
  "comment": "Comedy Horror trend was start in Bollywood with Akshay Kumar starer 'Bhool Bhulaiya' released in 2007, there after We have never watched any Comedy/Horror up to that level. Will 'Stree' leaves up to expectations or not?\n\n'Stree' is flavored with mixing of Comedy & Horror. Some Horror Scenes are really Spooky and Scary will give you goosebumps, wheres on other side some Witty dialogues are working as comedy to carry movie forward. Rajkumar Rao and Shraddha Kapoor both are superb! in their performances. \n\nOverall, 'Stree' is a perfect movie for those who like to watch Comedy Horror's genre. Don't miss these one. Go for it."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "santoshdogra",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "hooked & spooked in this horror comedy blended entertaining original potboiler.",
  "comment": "#Stree Based on ridiculous phenomenon, where men in town are told by mother sister & wife to not to roam on road at night, as witch of modern india is on hunt on 4 festival nights.\n\nThe experimental horror comedy genre movie is witty, scary, hilarious & entertaining. \n\n@RajkummarRao has the ability to get into the skin of character and make it lively & real, whether its chanderi ka manishMalhotra or RakshakRaja... He reminds us of #ShahrukhKhan in his early days, where he used to play character with such intensity. #RajkumarYadav is surely #EverymanCharacter @TripathiiPankaj excellent timing & witty delivery makes his presence felt strongly. @Aparshakti & @NowItsAbhi as friend of Vicky shines and makes up for other 2 pillar of movie. @ShraddhaKapoor in mysterious role of #Stree remains conundrum riddle. @AmarKaushik keeps the thriller running in pace & keeps people glued till madhyantar. He mixes background sound well & timely to overcome shortcomings of ordinary visualeffectless ghost. He smartly keeps unanswered questions for the sequel.\n\n\n\nTucked away beneath the scares and the laughs - but never buried out of sight completely - is the film's feminist subtext. In some instances the case is made expressly, like Tripathi's character pointing out that the spirit in question is a \"naye Bharat ki chudail\", who, unlike men, doesn't believe in \"zabardasti\" and understands the concept of consent. After all she calls out the man's name first, waits till he turns and looks into her eyes before claiming her victim. Mostly though the message about how our society treats women is cleverly subverted through scenes like the one in which men across town are terrified to go out at night.\n\nThe movie also points out unless you change to think for woman & respect them, things wont change in daily life. There is an old proverb, \"If you treat woman like dog, she will make your life Hell\". Woman when worshipped & respected, she becomes #MaaDurga, but when she is disrespected or humiliated, she becomes #MaaKali Movie which begins with \"Oo stree kal aana \" Ends with \" Oo stree raksha kana \"\n\nGet hooked & spooked in this horror comedy blended entertaining original potboiler."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "kasturiani",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "It's a must watch",
  "comment": "You can't get bored watching it multiple times. This movie is full of humour,comedy and horror. One of the finest movie so far. And Rajkumar rao proved he is the best with his impeccable acting ."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "himal-58624",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A fun watch",
  "comment": "The effects and the \"stree\" actually looked scarier than the Nun! I love the angle of adding comedy to horror movies. A few tiny jump scares! Perfect movie to watch with someone who fears watching horror movies!"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "arunknair-11496",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Social message with a blend of horror and humor",
  "comment": "What if there is a society where men are afraid to roam freely or have to wear saree for protection. Seems interesting right?\n\nJust like the theme, the execution of the movie is also too good. Rajkumar Rao is at his best and music is another USP of this movie."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "nihalnova",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must Watch",
  "comment": "Super Awesome movie. A must watch from Raj Kumar Rao"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "bakulmatiyani-1",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Goosebumps, a laugh and then some...",
  "comment": "It rare for a film to leave me thinking about it again and again for upto three days after seeing it especially in the Indian and specifically in the Bollywood construct. But every once in a while there comes a film that achieves the dream. It has a good story, the subtext is engaging and not buried too deep to be lost to the masses, good performances great writing (dialogue and screenplay), and a technically finessed presentation of all these things. In short the whole far exceeds the sum of its parts. Stree did all this for me. This is (at least as far as I know) the only original horror story in quite a while along with Pari earlier this year. What is surprising though is that more young directors are waking up to the promise of a genre of filmmaking that had long been ignored or at the very least been getting the step child treatment. This is a genre that had almost been relegated to B grade films save a few sporadic diligent efforts. As much as I enjoyed Pari, Stree for me is the holy grail as far as the horror genre is concerned and this coming from someone who doesn't like watching horror films in general. Yes I get scared and I can't go to dark alleys and their ilk, there I said it. But Stree was all that and so much more, the condiments of social commentary that were so effortlessly scattered throughout the length of the film were a delight. From \"Tumne humaare kal par moot diya\" to \"Bhakt mat bano\" and Finally the brilliant last image of \"O Stree raksha karo\" Just gave me goosebumps. It was and ending that put the perfect exclamation mark, asked the right question of a society that has turned half its population into a minority and at the same time gave us a slap in the face to wake us up from our laid back slumbers. How long will we wait and let the ghosts of women past haunt us before we say enough is enough."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "khanhamid-94216",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Much needed horror comedy",
  "comment": "Script ⭐⭐⭐⭐ Screenplay. ⭐⭐⭐1/2 Dialogues. ⭐⭐⭐⭐1/2 Cinematography. ⭐⭐⭐ Direction. ⭐⭐⭐⭐ Acting. ⭐⭐⭐⭐1/2 Music ⭐⭐⭐1/2 My Recommendation Rating ⭐⭐⭐⭐⭐"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "purohitkanchan",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Superb movie...rajkumar you r the best actor",
  "comment": "Best movie ever....very entertaining and paisa vasul movie"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "adityasinghbhati-77598",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best horror comedy movie",
  "comment": "I liked the movie very much because of comedy specially and storyline. This movie is very well directed and moreover it was shot at real places and that s why we feel more connected. This movie is scary too where it should be and complete cast is very well chosen especially Rajkumar Rao and Pankaj Tripati. All the songs in the movie are very ejoyable and support the flow of movie. This is a must watch movie. I wanted this movie to be little longer."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "Andyjadeja",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "The film is more of humor and then horror making it a perfect comedy genre film",
  "comment": "The film Stree is a horror comedy, which is based on the Indian urban legend called Nale Ba, who happens to be a witch that knocks people out from the door during the late night time."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "drmayanbhatia",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good movie",
  "comment": "Nice acting by rajkumar rao. Nice direction. A good combination of comedy and horror. Songs below average."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "kankanapar",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good movie with limited story",
  "comment": "As usual very good acting by Rajkumar Rao. Story is limited both in space and time but full of intense moments and comedy scenes bring laughter time to time."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "anujtiger",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome",
  "comment": "Osm acting of rajkumar Nice story Comedy funny ghost"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "pradhan-abhi",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Entertaining",
  "comment": "Great message to society. Unconventional plot. Superb acting by everyone. Excellent direction, dialogues and editing. Fun unlimited while experiencing in a theater."
}, {
  "rated": "",
  "out_of": "",
  "userid": "dhurveamrit",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Brilliant Actors in this Movie - Stree",
  "comment": "Suspense thriller+Horror+Comedy= Ek Dam Jhakass Movie All the Cast has worked well, Music is also good, Actress Shraddha Kapoor has indulge in her role. But the movie has not clear most of the things .... And if possible makers has to make another part of this movie to clear most of the things."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "siddiquiawake",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome movie",
  "comment": "This movie shot in the small town backdrop of india gives us a sense of stories that revolves around and sometimes people believe in that superstitious stuff and how there life revolves around it"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ppriyasingh",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Entertaining",
  "comment": ""
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "snehilk",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "The new theme starts",
  "comment": "This is one of the greatest idea in the bollywood as horror comedy often includes 80 per cent horror and 20 per cent comedy but this one got something in it as it contains 80 per cent comedy and 20 per cent horror. I was not able to get my attention away from the movie with this movie a new theme of horror comedy starts. #savageagainstghosts"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "yadvendra-41413",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A horror movie, which won't haunt",
  "comment": "Good movie, worth watching. We're laughing throughout the movie, & laughed more on horror scenes, hence those afraid of horror movies this isn't at all a horror movie. Good pieces of acting."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "ajayw6",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Fun combination of comedy and horror",
  "comment": "An enjoyable film based on an urban legend from the heartland of India. It is a commercial film which delivers a social message without boring the audiences. Rajkummar Rao like always is the show stealer. The film also has Pankaj Tripathi which makes a treat to watch."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "skrockzzzsahil",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Horror comedy film",
  "comment": "Film was just superb and rajkumar acting was amazing it was full of comedy and some scenes were scary otherwise it was full of comedy sound effects were awesome. Paisa vassool movie"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "mushtak2050",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Horror with comedy it's amazing to watch",
  "comment": "It's good movie to watch filled with comedy and horror. all actors do fabulous job specialy rajkumar and aparshakti."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "Lavnishkrsharma",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Hats off to Amar Kaushik",
  "comment": "In India, to make a horror film is a big task. Big because it involves lot of things, the director has to not only to keep the thrill and horror going but also has to keep audience in fear all the time and this task becomes more difficult when there has to be some comedy element in it, without making the people forget that they are sitting is a horror movie. Director Amar Kaushik has attempted such a thing in this film and has made it to the mark... The story of stree is about a village name Chanderi, where every year a specific paranormal incident occurs. Every year a ghost of a woman comes to the village and hunts down men from that village. Vicky played by Raj Kumar Rao meets Shraddha Kapoor and falls in love instantly but to his shock he later realizes that the women he is in love with is that Stree. The film is very well written, not a single time you will feel that you are losing interest in the film. There is a kind of balance in the film which I liked the most about it. It does not focuses on any one side in particular, during the horror sequences, you will definitely feel the chill and when the comic sequences come, you will get relaxed from that horror chilling effect. Talking about the acting part, Rajkumar Rao and Pankaj Tripathi, are the stars of this film. You will rarely see such films in Indian cinema."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "chaitanyajohn",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Craziest horror movie till date in Bollywood",
  "comment": "This movie starts with crazy story about the ghost called stree but soon hero realises the way to stop her from taking the men from the village.will it be stopped or not is the story which is fun filled, horror and comedy which takes you all for the craziest movie journey. Look for stree getting succeeded or not."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "nileshmehta-99076",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Respect Women",
  "comment": "The story is all about how a woman is disrespected in front of all when alive & after dying she haunts the all men of the village."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "dhruvsuthar-90633",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Pankaj Tripathi Is A very precious Actor.",
  "comment": "When You have a Story And the screenplay which can be the main factors of any kind of cinema then you can make it to the right ways. Here the budget of the movie is very less but the script is way batter than the usual good movie. This film is a black comedy about a town in madhya pradesh where a witch comes in the four nights in order to find her lost love. \n\nScreenplay takes approximately ten minutes to set the tone of the film And then every second of the film is In the perticuler flow. Dialogues are hilarious which are written by sumit arrora. Cinematography Is Delightful, some of the scenes are shot in the dark lights. Story screenplay And dialogues are the highlights of this film for sure. \n\nCome to the performances: Raj kumar rao as biccky is Very good. His comic timing is excellent in some of the scene especially climax. Aparshakti Khurana Done a great job where he is in the outfocused in some scene but he is in the character At the every frame From start to finish. Abhishek Banerjee is great also. \n\nSometimes i think These are the character which are written for Pankaj Tripathi Only. Like in Gangs of wasseypur, Bareliy ki barfi, Newton, Gurgaon. His character is very well crafted. Shraddha Kapoor is good in her place.\n\nDirection is top class and because it is the first film by amar kaushik He is very talented. Looking forward to see his work in future.\n\nJust one Thing more Do not take it seriously at the terms of the stories. This is very fresh in the indian cinema So pelase Let it be. Stree is one of the best films to be produced and directed in the year of 2018 in the history of the indian cinema. Watch it for the Performances and writing. \n\nFour Stars Out Of Five Eight starts Out of Ten. \n\nThank you."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "dhanushrao-41666",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A worthy comedy horror film",
  "comment": "After a long time stree gives us a feeling of a logical comedy horror which is even filled with a quality comedy"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "mishramanit",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Another gem added in horror comedy!!!",
  "comment": "Seriously when its come to horror comedy only few movies are according to me are well made..stree is one of the best horror comedy in recent time & yes films like golmal again and nanu ki janu dosen't contribute anything to this genre... Stree is a must watch..watch it for its horyifing & hillarious content. Dont miss."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "bvnisarga",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "The Four Musketeers😂",
  "comment": "It is an irony that in a movie called 'Stree' the men have the best parts. Rajkumar Rao, Pankaj Tripathi, Aparshakti Khurana, and Abhishek Banerjee are brilliant with perfect comic timing. (Pankaj Tripathi, in particular, steals every scene he is in). They are the four Musketeers, battling the entity Stree. Hilariously. 'Stree' as an entity is part ridiculous, part hilarious, part scary and completely original. Amidst all the chaos lies a very subtle message, subtle but clear. For a horror movie, It is refreshingly original and witty. Easily one of the best Hindi movies of this year."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "jk7422-227-675610",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must watch",
  "comment": "Rajkumar Rao and Pankaj tripathy are in top form... Horror + comedy is a tough genre to execute... And after bhul bhullaiya this also delivers as well"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "prashantmishra-04311",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Mind blowing horror comedy.",
  "comment": "After a long time we have seen a good horror comesy after golmaal again.The movie seems promising n full of laughter doses.The character seems genuine n very promising with a good comic timing.Obviously good direction screenplay story thumbs for all.Rajkumar Rao marks his presence in the movie.Shradha seem a bit average but aparshakti and pankaj tripathi do justice with their roles.The plot seems obvious n generous but could have elaborated it more."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "karugupta-54390",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "One of the Best Horror Cum Comedy Movie",
  "comment": "I recently watched this movie with my family... Intially it was little scary but slowly we enjoyed the movies lot... I found it more a Comedy movie 😂... #RajKumarRao's acting is supperbb.. We glued to the seat... Movie binds you whole 3 hour..lots of time we burst in laugh... Just go for it guys!!!"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ietishmalik",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Perfect blend",
  "comment": ""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "anasu_89",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Raj Kumar Rao and Pankaj Tripathi stole the show",
  "comment": "After Bhool Bhulaiya, Stree is one of the gems that brought an amalgamation of Comedy and Horror on a next level. The ending will make its viewers waiting for a sequel. Stree is a slow drug, that will definitely make it a sleeper hit. What you will find in this movie: 1. Eerie ambiance 2. On point comedy 3. Spine chilling horror element 4. And Raj Kumar Rao"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "jhonnyjoker",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "sweet one",
  "comment": "A really sweet and cute yet horrifying with great message in the end"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "anupkranal",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Finally a horror comedy which has struck right chords",
  "comment": "Horror comedy genre is not yet well explored in India and maybe Stree will be a beginning. Not that it hasn't been tried in Bollywood, it ihas been but with no success. The person who has tried his hands in horror comedy was no other than Ramgopal Verma with Darna Nana Hain and Darna Zaroori Hain. But they were not well received by the audience. \n\nRajkumar Rao has been growing leaps and bounds and he has been terrific again. But this time it is the supporting cast which has made a difference.Abhishek Banerjee as Rajkumar Rao's friend in the movie managed to earn laughter whenever he was on screen. Pankaj Tripathi who has now a go to man in Bollywood never misses a mark and nor he has in Stree. He played a very quirky role of a researcher who has researched a lot about the witch(Stree).He carried on his excellent form from where he has left in Newton. Shraddha Kapoor is decent but the meatier role has gone to the supporting cast this time\n\nThe screenplay is fast and taut and there is never a dull moment in the movie the writers Raj and D. K. ensured that. \n\nThe dialogues by Sumit Arora are quite innovative such as \"o stree kal aana\". \n\nAs we glance over the history, most of the movie in horror comedy genre doesn't scare the audience and here Stree scores over others. Stree has got some good over the edge scary scenes.Director Amar Kaushik did a commendable job by making sure that the horror is not lost in the comedy. \n\nThe movie also has subtle social message and commentary on patriarchal society. The focus on this social issue felt half baked and could have been given more focus. \n\nThe songs somewhat felt unnecessary especially the item numbers. The music is good but should have used more in the background."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "daddysgal",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Watch it guys😃",
  "comment": "It will keep u gripped right from the start to the end. Rajkumar Rao has been excellent, I don't want to give out spoilers, but... U shud watch the scene where he \"HAS\" to express love... My god... What acting! One of the most versatile and talented actor... Loved it❤❤❤❤❤"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "vaibhavhellrana",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Enriching",
  "comment": "Ahhh!!! It was a roller coaster ride full of laughter and scary emotiOns."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "admajum",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Rajkumar Rao rocks",
  "comment": "Awesome comic timing with great fictional content. Rajkumar Rao rocks and Pankaj Tripathi sir is as phenomenal as always"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "manvitiwari",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Lovely movie.. Too entertaining!",
  "comment": "Do watch! Its the best horror movie bollywood has come up with in a long time!"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "saikatdanger",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best horror comedy after bhool bhulbhulaiya",
  "comment": "Womderful combination of laughs and chills stellar cast..sound effect game top...rajkumar rao omce again shines...pankaj tripathy is spot on...a movie with a message that doesnt try to push home a point...great watch .."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "ambkpoonam",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best horror comedy movie ever",
  "comment": "Simply amazed with the story line concept and acting. Every situation was feeling so naturally funny. Every actors have done a great job but most importantly the direction. Quite surprised that it's a directors debue film"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "janhavib-43434",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Just loved itt....",
  "comment": "Awsome movie after so long in bollywood....the acting was too good of the cast....n also loved the theme of movie...its a worth watching movie...!!!"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "vishalkamblepromo",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best film if you want to find Comedy and Horror at the same time",
  "comment": "Loved this movie. In past there were many horror comedy movies that failed to impress me, but I gave this movie a try since it was Rajkumar Rao as it's lead. And I must say like all of his other movie this movie too was great. Special mention to the cinematography and sound effects which I think has played major role in the success of this film. Shraddha Kapoor, Aparshakti Khurrana and all other side characters too played their role well. In short this movie is complete package of entertainment. And if you are weak hearted then just remember: O Stree/Mard(in case you are a guy) Kal aana"
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "sreddy-77042",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Not so scary not so funny",
  "comment": "This movie is basically rip off of stereotypical indian horror film with some scary scenes n lil bit of humour , scary scenes are not to scary , comedy scenes are not to funny , but few punchlines n jokes are good , it's an okay film this film doesn't meet any expectations"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "krunalanada",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Wonderful",
  "comment": "Best movie. It was amazing.. Just the ending was not good as it is supposed to be."
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "shrivnaman",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Review by a student.",
  "comment": "It's a comedy horror movie. Cast of the movie performed their best according to the script demand. Whole story is is about the 4 days of goddess worshiping festival at Chanderi town of Madhya pradesh,India. Comedian Vijay has a short and serious role too, he may be used as a lead comedian. Mentioning of late prostitute mother of protagonist is completely un-relevant. Ending left most of the audience confused about the mysterious girl(witch)."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "adeshdixit",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Gripping and unique story line",
  "comment": "Stree is one of its kind attempt in Indian horror comedy and showcases a variety of amazing actors who keeps audience engaged throughout the movie"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "bsoumyaranjan",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "HORROR COMEDY",
  "comment": "Rajkumar Rao's best movie till now.. Contain based movie suprb.."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "drpatnaik-30110",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A big theatre watch",
  "comment": "Irrespective of what expectations you go into the movie, I doubt you will come out unsatisfied. The movie's cinematographical effects are worth your money. On top of that, masterful performances from the leading characters make it an endearing watch. Just when you were sure that you have resolved the mystery, the final twist arrives."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "d-71625",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best movie",
  "comment": "Best movie its i think this movie cross 100 cr. In india so its best movue 2018"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "lalitsinghlsc",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome",
  "comment": "It was amazing . Everything was perfect. All the actor acted beautifully."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "iamsameer-54661",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Dgfdtjhsa",
  "comment": ""
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "vibhordwivedi",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Brilliant Horrorcom satire",
  "comment": "#StreeMovie# a horror comedy but a cocktail of satire and dark humour like meduca from greece which is good in taste but hard to digest if u dont feel comfortable wid higher dose of feminism... N if u are, then go for it. its a well written movie with a fresh premise, outstanding work from sumit arora (dialogue writer), good direction. pankaj tripathi, aparshakti, abhishek banerjee n surprisingly shraddha kapoor all r good but rajkumar is the master of his craft in every scene n every movie... bollywood's best horror comedy"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "kashishsinghal",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best horror comedy",
  "comment": "Rajkumar Rao acting is great and all the characters well played"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "vastanleyaeva",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Complete entrainment",
  "comment": "A complete entrainment movie Rajkumar Rao and Shraddha Kapoor have done a great job"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "rabibhattacharya",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Another fine knock by Rajkumar Rao",
  "comment": "An awsome spine chilling horror flicks with fine blend of hilarious dialogues and comedy from rajkumar rao and co. A must watch!!!!"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "rmane-64532",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome",
  "comment": "Stree was a complete horror comedy movie.I really enjoyed a lot and Shraddha Kapoor was awesome in this movie."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "umangagarwaljuly",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Fantastic horor comedy😚",
  "comment": "Awesome Go for it.It won't disappoint... Go and watch it now"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "anamikasinghas",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Stree(Raj Kumar Rao)",
  "comment": "One can watch his movies without any second thought that what if it won't be worth a penny. He is just too awesome with his movies."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "mdyaser123",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A genuine attempt in horror-comedy genre.",
  "comment": "A good movie with few good laughs and thrills. Rajkumar rao and Pankaj tripathi at their best. The ending of the movie will lead to a lot of debate until the next installment. Catchy songs add bonus to the movie."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "bnrt",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Excellent fil.",
  "comment": "A brilliant film with a great message and great entertainment. The best of horror comedy in indian film industry"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "prateeksharma-70879",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome movie",
  "comment": "Overwhelming performance and new story makes it done"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "vandananqg",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must watch for horror nd comedy lovers",
  "comment": "Amazing nd more then expectations. Lovedd rajkumar rao nd gang's role, amazing comic timing nd ofcourse character role artist were tooo good. Shardha kappor have done good jod. Though there were not so scope of her role.. But of course by the climax expecting sequal.."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "anuradha-27284",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good one",
  "comment": "Great combination of horror and comedy.i had seen twice and waiting for the next part"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "rohitsharma-09703",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "excellent",
  "comment": "Excellent ygsdgetjsfjshfahdageahdahdhebdgeyeyeheyeyeyeyeayrarustististiair to work e"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "duttaspiyalipd",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A decent and good movie to feel entertained a few hours.",
  "comment": "This movie has a simple storyline that will let you enjoy it throughout the time you spend watching it. Most satisfactory thing is that it portrays the horror and the fun elements very appropriately. You will feel scared as well as laugh while the story plays along. The relationships between the characters are played very carefully so that you can feel connected with real life.\n\nThe acting talents of all actors were very good. The director did a good job.\n\nThe overall story of the movie revolves around 3 friends and how they turn out heroes of the town. Though the whole movie is very understandable but the climax is not very clear, due to which the mystery still remains a blurry mystery, though most people make up their own theories and its fun to discuss.\n\nOverall it is a good movie to watch and talk about even after a few days since it does leave an impact on the viewers."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "samyakjainin",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Loved it....",
  "comment": "Gr8 movie with light comedy nd strong acting of actors as well as co actors egarly waiting for next part."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "rsaurabh-64775",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "horror comedy",
  "comment": "This movie is completely based on horror comedy. Every one give his or her 100%. must watch"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "gsonal",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Great piece of comedy drama and little pinch of horror",
  "comment": "The best part about this movie is its awsome and well selected cast with great acting ......"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "zohivkhan-66472",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "One time",
  "comment": ""
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "hunnyailsinghani",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Basic Plotline with unique presentation",
  "comment": ""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "ujjjwalthakur",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Amazing !!!",
  "comment": "A great blend of comedy and a horror movie, totally a must watch."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "vineethchandran",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Great Movie. Purely entertaining.",
  "comment": "This is a very entertaining movie. It will make you laugh a lot. It's a lot of fun and you see a lot of great performances. The story doesn't lag anywhere in the movie and you will never get bored or exhausted."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "abhisheksagar-61810",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Mast hai",
  "comment": "Movie that will make you laugh and feel spooky at the same time"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "amarrajkavi",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Horror movie",
  "comment": ""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "thaneshilpa",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Absolutely Awesome 'HORCOM'😂😨",
  "comment": "Direction is perfect. You don't get bored at any single point in this whole movie. RajKumar Rao has just nailed the performance. You can clearly see extremely talented actor who can fit in any kind of role. Chemistry between Aparikshit , Abhishek, RajKumar Rao and Pankaj Tripathi is just amazing. Everyone must see this movie in Theatre, coz the experience of HORCOM (Horror Comedy) is outstanding."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "adilmokhtar",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good",
  "comment": "Good great acting everything is ok and entertaining"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "manishraiyadav",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Very fabulous movie",
  "comment": "Very good actors played their role very good specially Rajkumar and Sonam"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "sankarbadatya-50830",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Superb",
  "comment": "Superb story Horror and comedy will be must watch for everyone"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "hritamloyola",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A spooky comedy worth your time !",
  "comment": "The movie has its eerieness, suspense and thrill just enough to occupy your minds. With it goes the hilarious punch lines that ought to make you giggle.\n\nThe characters have portrayed by the actors in a very effective and relatable way which is a big standout. It does not end just here. The climax is quite well planned unlike many films.\n\nThe end scene is a bit weird, not generally adopred by Bollywood movies, thereby hinting at a possible sequel. The movie is a big relief from the other mainstream Bollywood horror films which don't catch your attention or imagination. A mustvwatch for movie lovers !!!"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ankitankitshrivastava",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "........ . . ..... . . ......",
  "comment": "......... . ........ ........ ........ ......... . . ........"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "brsy",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "One watch!",
  "comment": "Script is new, movie is awesome! Acting wise r.rao is best,but sometimes shraddha spoils the show!"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "pulkitpandey",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Sooo goooood!!",
  "comment": "This movie is so perfectly made....I mean the combination of horror , comedy and romance....the jumpscares and the touch of romance it's just the best we have had from Bollywood this far....this movie gives quite a tough competition to the Hollywood franchise.......loved it💕."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "amashishmahour",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Great acting and comedy but lots of tantra mantra..",
  "comment": "All and all it was a great movie which has a great comic performances.. Rajkumar, Abhishek and Pankaj sir acted really well. The only thing that i didn't like was the tantra mantra included in the movie."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shaikhadnan-99829",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Comedy mix horror adventure",
  "comment": ""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "vasavsabhlok",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Just awesome",
  "comment": "More scary than The Nun. Really funny with some adult jokes in between"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "vujjwal-25355",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Mast",
  "comment": "Nyc one must watch film. Quite hilirious and horeible."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "sparmar-44627",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Super duper awesome",
  "comment": "No words..... It had awesome comic timeing..... Perfect cast...."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "mominati",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "What film",
  "comment": "What film is this awesome love it . If this movie will create a new part of stree then it would be nice to see this movie"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "skumaramit",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Nice Movie",
  "comment": "Acting of Raj Kumar Rai and Shraddha Kapoor was awesome..."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "wwwdharmendragusain",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "best etertenig movie",
  "comment": ""
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "anuragc12",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Decent attempt at horror comedy",
  "comment": "Movie is very much enjoyable and has good comedy. It is an example of horror done right with right dose of comedy..Acting by all the actors is very much relatable especially by Rajkummar Rao and Pankaj Tripathi."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "gautamkuckian",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "New kind of masala entertainment",
  "comment": "Everything is good except for the item no which feels out of track.. performances are great .. rajkumar rao nails the role..all the supporting actors are good..."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "imranvardhman",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "One time watch",
  "comment": ""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "gargapurva",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Stree",
  "comment": "Just a wow.. enjoyed with gang... Loved the movie... loved rajkumar rao ..."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "prashantmishra-04311",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "The movie bring back a good taste of horror comedy.",
  "comment": "We have seen so many best horror comedies like bhool bhulaiya,golmaal again,any many more which are best in their class and same goes with stree. It has all those things that a good movie requires weather it is screenplay,characters,plot,dialogues and etc.Being based on a ridiculous true incident the movie also has cinematic approch that makes it even better. And rest says the box office collection. Rajkumar rao is just mind blowing, pankaj tripathi as always was in the character and aparshakti khurana too did his job well.Shradha kapoor also seems to have acted well. Great work n one of the finest movie in the genre"
}, {
  "rated": "3",
  "out_of": "10",
  "userid": "harshalpatel-16660",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Less scary and ok",
  "comment": "Stree\"... O Stree Kal Aana ! Raj Nidimoru & DK weave a story around some superstitious folktale where it is men who are in danger if they roam alone in night in the sleepy town of Chanderi in MP.\n\nA good job by director #amarkaushik on handling a new genre ..horror comedy ...the locale were real ..house , locality even many artist were local villagers ... however the story gets confusing at the end ...what was Sharadha Kapoor character (w/o name) actually trying to do ...guess we need to wait for Stree-2.\n\n#rajkumarrao , the underrated actor, does a great job balancing romance and fear equally good were #pankajtripathi (the Ghost buster) and #aparshaktikhurana & #abhishekbanerjee as friends. They all share equal footage in the movie.\n\nThe track on misogyny and chauvinism which looked more pushed into to make movie preach about social cause was half cooked and very disappointing.\n\n#sharadhhakapoor looked very confused in the movie and I won't blame her as story around her character was not well etched by writer-director keeping lady of the movie and audience baffle ..akhere ho kya raha hein ...\n\nIf you can take bit of Ramsay Brother horror and enjoy watching #rajkumarrao then go for it else give it a miss ....\n\n#sachinjigar music was best to forget as post movie you won't have any recollection ...."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "aqeebmustafa",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "What an absolute great piece of art!",
  "comment": "Rajkumar Rao is a boon to Indian film industry.. what a convincing and marvellous delivery by him. This movie deals with a major social issue in the most sarcastic and hilarious manner. The supporting cast along with Raj makes it a great watch.. loved it!"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "dawaleswapnil",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "good comedy movie",
  "comment": "This one of the best movie in horror and comedy movies. bollywood try to make some new thing. and this movie prove that indian audians like that"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "faisalstjosephs",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A Perfect Ho-Comedy",
  "comment": "Stree is a film you'd love watching with your friends and family. It has got everything for a perfect horror comedy... Also it has a confusing ending that has the potential for STREE 2"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "yashjalan-71779",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Comedy Horror",
  "comment": "This movie is very comedy and the acting, casting, comedy and direction is at it's best. The music is also good. But the main thing is it is not a family film and will be a great fun with friends. As a horror movie, it is avarage. The movie is also thrilling."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "karankhan-12058",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Superb",
  "comment": ""
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "DivyaInduSharma",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Worth a watch!",
  "comment": "Alternating between goofy and scary, Stree's actors have done a superb job of staying authentic to their roles. Horror and comedy are opposite genres and this movie manages to strike just the right balance between the two so that the end result is equal parts scary and funny and 100% entertaining, instead of being a jumbled up farce. Hopefully the sequel will be equally good if not better."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "maanyaar",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Siraa",
  "comment": "SiraaAjjsnsjdnd sjsjsnusjd. Susjnsdhdb jisjsbdbdvdv. Djsundbd d idjdb d x"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "shruti-56691",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best movies and stree",
  "comment": ""
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "himmatmeena-27807",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A new version of horror movie",
  "comment": "Must watch if you like horror movies...New content with different idea"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "dineshk",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Average comedy , novel horror story",
  "comment": "Comedy is average . The horror piece is good with a novel story. Shradha can't act ."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "sahu-60295",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Stree",
  "comment": "Misogyny and chauvinism are social evils that exist in both first and third world societies. Whether you're educated or civilized, women have always had to play second fiddle in the male-dominant system. The world would certainly, do well to give women far more respect. To see such a pertinent conversation unfold in a horror-comedy like Stree, is a unique experience. But, it feels a bit jarring, when a film that pokes fun at horror film ideas and entertains the audience with its quips, suddenly bursts out into a comment on feminism. In a bid to be socially relevant, Stree ends up being a little too preachy.\n\nMisplaced, good intentions aside, the writing for this genre-bender is very good, especially in the dialogues department. Horror comedies are a rare offering in Hindi cinema and in that respect, Stree serves up a lot of thrills and spills. The small-town setting and the many jibes at horror film legends are hilarious. The funniest character in the film is Pankaj Tripathi's Rudra, a bookshop owner and Mr know-it-all, who guides Vicky and his friends on how to cope with Stree and her haunting act. Tripathi's comic timing is top notch and one of the veritable highlights of the film. Rajkummar's performance is just as good. He handles the many shades of comedy, horror and romance (in a brilliant throwback scene to Shah Rukh Khan) with great ease. Aparshakti Khurrana and Abhishek Banerjee as the friends offer good comedic punches too. Shraddha Kapoor's character is a bit of an enigma. Even though the role is problematic, the actress does a fine job of maintaining an air of mystery.\n\nStree does fairly well with the comedy, but even with several laugh-out-loud moments, the film feels a little too long. Towards the end, the movie drops the horror comedy treatment and becomes a little too serious about the conventional stabbing-the-ghost-in-the-heart kind of ideas that often play out in horror flicks. Also, it doesn't add up that a film trying to advocate respect for women, has a song called Kamariya, where men dance around a skimpily clad Nora Fatehi.\n\nDespite all its flaws and ambiguous ideas, Stree is still an entertaining film. This is an experimental comedy, that creates an eerie atmosphere and it manages to be funny and scary at the same time. Writers Raj and DK (who have directed films like Go Goa Gone, 99 and Shor In The City) bring in their trademark humour. The film has its absurdities, it also has its moments but the final act let's it down."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "jwlbkeoo",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "HORROR AND LAME COMEDY",
  "comment": "IT WAS NICE MOVIE BUT THERE ARE SOME SCENES WHICH ARE BOARING...STREE IS ABOUT A REDICOLOUS PHENOMENON MOVIE BUT SOME SCENES ARE FRICTONAL RAJ KUMAR RAO WAS FULLY ENERGISED BUT SHRADHA KAPOOR WAS DOING OVER ACTING...ONE TIME WACH MOVIE"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "mehtamayank-35225",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Mixture of comedy and Horror",
  "comment": "Unlike very few bollywood films, Stree is a mixture of comedy, drama and horror. Great acting by Rajkumar Rao and Pankaj Tripathi. Shraddha Kapoor's role was ok. Great direction and screenplay."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "kbswami",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Mix of comedy & horror Best acting by all actress",
  "comment": ""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "yugandharamohod",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Very awesome movie...",
  "comment": "#Stree is an amazing movie... It's full of fun, laughter, comedy, drama & some thrill... I liked this movie too much... It's about to love & respect every women without thinking what she is... 😊"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "kalyansachin-22947",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Entertaining",
  "comment": "Reminds of local rumors .. scary yet entertaing.. superb acting performances.. content based music...gud direction... must watch..."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "imrankhanh0402",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Very unexpected, Overall Good",
  "comment": "Totally different from what i predicted, fresh way of story telling, wonderful work done by Rajkumar and Shraddha, music is average, only milegi is foot tapping. A decent watch with family. Go for it."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "Shubham_dabi",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A nice movie",
  "comment": ""
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "manishamk",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good enough",
  "comment": "Movie is good enough to watch but only for one time"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "casuwalka",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A mist watch",
  "comment": "A Great mixture of horror and comedy. Rajkumar rao and gang rocked"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "mr-shekhar88",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "There's going to be a sequal..YAYYYY!!!",
  "comment": "Never have I loved a movie so much since Munnabhai, 3 Idiots and Oh My God - I don't care much for art movies with high ratings, I have a simple philosophy, if I would want to watch that movie again, I rate it upwards of 8 and I'm going to watch this movie probably 10 - 15 times more just this year alone so ya, I loved this movie, everything about it and the best part is that there's going to be a part 2... YAYYYY!!!"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "atulmkamat",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A fun loving Family film",
  "comment": "The film is one of the best Indian horror satires in recent times. Regarding the performance, it is exquisite. Rajkummar Rao and Pankaj Tripathi make it a point of explicating how even an average script can be mesmerizing with a marvelous performance. Shraddha Kapoor looks beautiful. Regarding the screenplay, you get completely engaged in the film throughout its playtime. Genuinely, I was not happy with the climax. However, the ending was confounding. The movie can be enjoyed with family as well as friends. Overall, if you like watching light films with a bit of humor in it, you should definitely watch it. Even if your taste is different, you can watch it for Rajkummar Rao. I give it a 7 on 10."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "pandeybankim",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Stree movie review",
  "comment": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "deysoumyak",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome movie",
  "comment": ""
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ayushhero-28289",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Comedy and Harror",
  "comment": "This movie has nice story containing comedy and horror ."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "salgiap",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Great combination of comedy in a horror theme",
  "comment": "One of the best Indian movies in the genre of horror comedy. While the theme is horror, it evokes laughter through the movie which is the example of great direction. Kudos to Rajkumar Rao and his friends for phenomenal acting. Ending could have been more meaningful though."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "pra-71975",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Nice blend of comedy and horror",
  "comment": "Raj kumar rao acting is awesome. Nice blend of comedy and horror. Pankaj Tripathi is as always the best."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "satishsingh-07057",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "very good movie",
  "comment": "Rajkumar Rao acting is very good. And movie have good strory so i recommend this move to must watch."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "jainvivek",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Clever!",
  "comment": "A very clever horror comedy. We hardly have good horror comedies coming out of India but this one is surprisingly witty and consistently funny."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "cooolathar",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Above expectations!!",
  "comment": "I was not quite sure whether to go for stree or not. I was convinced to go and my reactions after watching was really overwhelmingly as the movie was marvelous. It was full of comedy and horror and both of very good level. I will definitely give extra remark for Rajkumar Rao's acting in the movie. I would suggest you to go and get entertained with each bit of it."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "raghunathreddymandapati",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Acting is great but lack of strong script makes it less watchable",
  "comment": "Rajkumar is as fabulous as always and he makes us glued to the screen."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "hs-53767",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A good combination of horror comedy",
  "comment": "After bhool bhulaiya i have seen such amazing horror comedy movie . Movie has full package of entertainment as it will equally make you laugh and fear . The comic timing of stars like Rajkumar rao, Pankaj kapoor,aparshakti khurana was outstanding . Based on the rural areas, the movie focuses on the story of a witch called 'stree' who use to take men from the town and leave their clothes . The concept sounds interesting and unique . Shraddha Kapoor also made every effort to fascinate the audience by her look and acting . Hence the movie proves that Bollywood can still create a good horror movie . The movie has everything which Indian audience wants ."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "tej-95441",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Stree - O Stree Kal Aana ! :)",
  "comment": "Stree - O Stree Kal Aana ! \n\nWhen I first saw the trailer of this movie my initial reaction comprised of two parts. \n\nFirst reaction: Rajkummar Rao, OK must watch! Second Reaction: Horror? \n\nGulp, I can't watch this! Gifted, talented, virtuoso, genius, accomplished, ingenious, masterly, inventive, creative are some synonyms of Brilliant. \n\nThese are also synonyms for the greatest asset that we have in Bollywood today Rajkummar Rao! \n\nThe last two words are probably enough to give this movie an outstanding rating but then that would be a disservice to the movie. Fantastic dialogues, brilliant punches and superb performances by all the other key actors (Pankaj Tripathi, Aparshakti Khurana, Abhishek Banerjee), I also found Shraddha Kapoor likable for the first time in her career. She lights up the screen in each and every scene and sigh, that large nosepin !!! (I admit that I have a thing for girls wearing nose rings or large nosepins). \n\nA bow to the director and the scriptwriters for the making such a hilarious movie out of such a ridiculous phenomenon and for maintaining the suspense till the very end of the movie. In the end though the real star of the movie is Rajkummar Rao (yes, here I go again). \n\nThere are scenes where the entire theatre was hooting and applauding the man. I must mention a couple of them, one where he is asked to express love to the ghost, and second where he tells his mates how Shraddha Kapoor convinced him to do a task for him. Is this any role left which this man cannot excel in? I do not want to disclose more about the movie and instead would urge you all to go out and watch it for yourself. Be ready for some massive massive laughs! \n\nThe theme of the movie is \"O Stree Kal Aana\", I'd like to change it to \"O Rajkummar Rao, Agle Friday fir aana\" and the Friday after that, and the one after that, and the one after that,, well you get the gist !"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "prateekmundra",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "OO Stree phrse aana..",
  "comment": "Awesome movie must watch, It was a horror comedy movie which was directed perfectly. Each and every member perfectly played his/her role in the movie. Waiting for Stree's next franchise. #Blockbuster"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "tonitinsood",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A lighthearted rustic comedy",
  "comment": "A stellar movie with some phenomenal acting and a crude, rustic touch. In fact the rustic charm and the slick one-liners make this movie a definite watch. Raj Kumar Rao is as usual hilarious and accompanied by two equally brilliant ludicrous characters, all wallowing for female company. Their quirkiness and buffoonery are comical. The end is also kept intriguing, keeping the audience perplexed and leaving enough out for a sequel."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "vamsikrishnadasariit",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Stree",
  "comment": "Based on an urban legend, this movie works out in every aspect. The cast has been the main asset to this film along with a powerful plot makes this film engaging throughout. All in all this film is a must watch for the performances of Rajkumar and Shraddha Kapoor."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "mdayesha",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Very nice movie",
  "comment": "Very nice movie nice concept songs were good background music awesome"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "vigneshvramani",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "New-age Bollywood at its finest",
  "comment": "I don't even care about the inconsistencies in the story, and the random music cutscenes... This movie was just fun to watch and totally deserves the 9/10 rating. Really good characters (for the most part) with all the leading characters having some brilliant dialogues and moments. Shocked to see a Bollywood movie devoting screen time to what would be called \"side characters\" in most other movies! And wait... character development!? No way! Can't believe they actually took the time to flesh out the characters and give them all their own individual quirks and personalities and actually develop them through the movie. Please watch it in the theaters and indicate to producers everywhere that India is ready to move beyond Shah Rukh, Aamir, Salman and Akshay."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "vipinrajnagar",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Jabarjast blockbuster",
  "comment": "Great Acting by Rajkumar Rao, Amazing and Unique story .. :) (Y)"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "mohitxy",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good Entertainer",
  "comment": "This movie is great mix of humour with horror and has a social message as well."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "rannoo",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Amazing Movie",
  "comment": "This movie is too good. But Its not the whole story. I am waiting for its sequel."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "sarthaklovey",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must Match Movie👍",
  "comment": "Best Horror Comedy Movie Of Bollywood... i Loved It And You'll Love It Too.."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "dfcr-90878",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Fresh Bollywood Film after a really long time",
  "comment": "I wasnt interested in watching this film until 2 days before release, Thats when I first saw the trailer and other promotional videos and got really hyped. I knew it from the start that Raj and DK will bring something new to the table. It will be wrong if I say anything less than \"The Best Original Film ever made in Bollywood\" or at least in last 5 years. I loved the way story starts around a small town with these 3 friends and it builds up to the point where you become the fourth character before you realize. I would love to reveal more about my experience but wouldnt wanna spoil it for anyone else. \n\nI am pretty sure this movie will be much bigger hit when it comes on tv for families."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "machineawees",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Brilliant",
  "comment": "Never saw such combination of horror and comedy in Bollywood"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "avinashmp-12285",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Amazing",
  "comment": "Just amazing, It's entertaining film for families and bachelor also... All actors doing their best..."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "vinay81091",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Ingeniously funny dialogues and tight screenplay",
  "comment": "Another brilliant performance by Rajkumar Rao. You can walk in to any of his movie and be assured of a gripping performance. The way in which the lead character is portrayed is worth appreciating. The movie brings out the social issues too and does impart a message in its own way. More comic than horror, must watch for its country style."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "nitinaroraasm",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good",
  "comment": "Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight Goodnight"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shardhanjalinag",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A WOW movie from RAO😍😍😍😍",
  "comment": "Amazing combination of horror+comedy. A must watch movie. 👌👌Paisa Vasool with 100% cashback😂"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "pundirsaurabh",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "smart movie",
  "comment": ""
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "ajaytambe-72343",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Stree Movie 2018",
  "comment": "STREE (2018)\n\nRelease date : 31/08/18\n\nStarring : Rajkumar Rao, Shraddha kapoor, Pankaj tripathi, Aaparshkati Khurana, Abhishek banerjee.\n\nDirector : Amar Kaushik Writer : Raj Nidhimoru and Krishna D. K\n\nDailouges : Sumit Arora\n\nRaj Kumar Rao : Rajkumar Rao always delivers an earnest performance, he has grabbed the whole film with a great catchy performance, in this horror comedy story the character of Raj Kumar plays as a lover boy who falls in love with the ghost (Stree) shraddha kapoor. His delivery of the performance has no boundaries and that's what has surprised the audience in many ways. The innocence on his face and the fictional character buildup has raised the bar for the movie. \n\nAparshakti Khurana / Abhishek Banerjee : These both are full of comic communication and delivery with crowdy laughter. These both presents such a Comic personality as people laugh even when they didn't make a move. Playing as friends of Raj kumar Rao these people are the most threatened from the horrible Stree interpretation.\n\nPankaj tripathi : Not much with the Dialogues Pankaj tripathi plays with the awesome punchlines, playing as someone who knows secrets of Stree, he is all set to make everyone laugh with his witty comment and punches. He has marked his presence with just his one look and way he delivered the lines. \n\nShraddha kapoor : Playing the kick role. Of the story Shradhha deliciously portrays horror woman and men's crush flamboyantly . Demand of her character was to look pretty and beautiful , shraddha made a mark with her performance too. The shades in her performance are something which is new and exciting for people to watch from her portray. \n\nStory : It's a horror comedy and little bit spice of romance. the story is about the ghost in chanderi city who haunts and kills all the men. The script speaks that Stree interpretation is shown as women now making men on the verge of death as chanderi village men's didn't get out of home after sunset. It's just the romance and fictional portray of female character who falls in love with the village guy and then all the fun begins. \n\nReview : It's a movie which carries an delicious humour for the audience with an amount of fear. Rajkumar Rao, Pankaj tripathi, shraddha kapoor all others are making it a blast. This horror comedy stree spreads a thought that now men are threatened by women and women will rule over them. \n\nRatings : 4 /"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "gagankohli-29839",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome",
  "comment": "Good movie. Must watch. Everyone has done beautiful acting and you will laugh for sure."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "manmadan-1",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "HorCom Movie",
  "comment": "First of all this is not seems like a director's debut film. Its perfectly made film with good script, music and the casting is awesome. There is no much scope for shraddha kapoor to perform. Award winning actor , most in serious role, Rajkummar Rao stole the show in comedy role. Perfect blend. There is no clarity on the censor certificate, A or U/A, some scenes, mainly dialog will not suit the kids audience. This is great entertainer of this year and it will go to other stats as remake."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "meghatripathy",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A beautifully executed horror-comdy. A must watch..!!",
  "comment": "A great combinatin of horror and comedy. Scare a little in one scene and laugh a bit more in the next.. great performance by everyone..beautifully executed...👍🏼"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "sumitdutt-30015",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Owsm",
  "comment": "Shraddha Rajkumar Rao Raj nd DK Full on masala best content too After bhoolbulahiya this is the movie which we r waiting for"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "jaypatel7-165-783315",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Great attempt",
  "comment": ""
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "srastogi-90935",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good comedy with horror",
  "comment": "Good movie with a wonderful mix of comedy with horror, more of comedy then horror. A strange combination, but well executed and worth a watch. Good performance by all lead cast.?👌👍"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "arvindjobs",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Perfection Epitomized",
  "comment": "Awesome combination of horror and comedy. While watching the movie I could feel people's seats were continuously shaking due to laughter and horror. Great performance by RKR, Aparshakti, Pankaj Tripathi. Its a must watch movie."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "onlinespn",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome ....",
  "comment": "Its a comedy horror movie in which all characters work fabulous mainly Rajkumar rao .This movie gave some thought about women. Fabulous movie .....must watch"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "vishpankaj",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must watch",
  "comment": "I watched this movie 2 times ......Fabulous again rajkumar rao is proved"
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "tanujpoddar",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good story badly written",
  "comment": "\n\n\n\n\n\n\n\n"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shwetasharma-55412",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "It's a laugh riot",
  "comment": "I have seen such a genuinely funny comedy after a long time. All the characters in the movie were extremely good. A must watch movie."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "rakeshon",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "An unique horror comedy movie",
  "comment": "It is a new idea and different in type. While watching it does not look like a horror movie but a comedy one. Love to watch a new concept."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "soulreava",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A Big Plus for both the Indian Comedy & Horror Cinema",
  "comment": "I rarely watch Indian movies unless strongly recommended by a friend or family member. I had the feeling indian directors had lost their touch and mostly we get titles with either cheap and boring comedy or unwatchable action movies. But every once in a while we get greatly surprised by indian cinema and its creativity and \"Stree\" is one of those movies, no doubt.\n\nThe acting, comedy, dialogues, horror atmosphere, storytelling and even the animation was superbly done. The timings of the jump scares and direction couldnt have been done better. The atmosphere will at times keep you at the edge of your seat. I really enjoyed the movie with my wife and it was our anniversary and we both loved it. This is one of those movies you ought to go and watch with your loved one or with your best buddies if you don't have a stree yet :)."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shreyanshu-24750",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Sandar",
  "comment": "Movie is awsm with strong story.turning point for abhishek sir and well done anurag sir."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "aarthishharikumar",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A Good MIX of Humor and Horror",
  "comment": "Acting : Acting by everyone is awesome. Rajkumar Rao and Aparshakti did well, Hatsoff to Pankaj yet another magical performance. Actor did well to grasp the local (MP) language. Comic timing were also up to the mark\n\nDirection: Phew, it takes a lot of courage to take on both comedy and horror at the same time, The director did very well, Script wise the writers did leave a few questions unanserwed. Probably will have a part 2.\n\nTechnical: Crisp editing, Sound effects and VFX were also great. The movies was shot very well. It was creepy at certain places.\n\nMusic: I personally liked the background score, It added the extra spookiness factor. Songs were good. Kamariaaaaa..!!! what a dance by Nora superb.\n\nAll in all a must watch movie. I Will go with 9 out 10."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "rashmisarkar-47992",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Earthy,creepy and humorous!",
  "comment": "Stree-Movie review The name sounded very old world but having heard good things about the movie,I was still in a dilemna whether to watch it or not as horror is not my favourite genre in movie watching.The last good Hindi horror comedy I watched was \"Bhool bhulaiya\" and I remember my son fighting as a small child to go back home every time the voice of Chitralekha,the ghost appeared!Besides the scare,his trying to persuade me to go back,added to the tension.Anyway,I was curious.And also remembered my years in school as the class monitor when I narrated many a ghost story to my class and hence pin drop silence was maintained.Part of these stories were what I heard from my mother or late grandfather,part of these were made by me by mixing 2 stories to make it long and a couple were cooked up by me on the spot,but narrated with a straight face.One such story was of a mysterious woman calling out to men on bicycles ( mode of transport then) in the dead of the night and men would be led into a blind alley .Only if they woke up from a daze like state , would they be safe!My late grand father (a physician) would narrate this with relish ,in first person and till date I don't know whether this happened actually or it was for my benefit.So \"Stree\" sounded like familiar territory. I am glad I watched it as it shows that Indian cinema is now making so much of a variety.Director,Amar Kaushik,makes a fairly interesting ridiculous at times movie with an engaging story by Raj and DK .It has an old world charm like a granny's tale and is rightly positioned in the small town of Chanderi in MP.Of course it is based on a phenomenon that occurred near Bangalore in the past.The dark dingy weaving gullies and streets add the right amount of creepiness to the film.So the movie has the right combination of quaintness, creepiness and earthy rustic humour to make you laugh and feel tense, alternately.\"Stree\" or the woman ghost comes every year on four festival days annually and calls out at lone men in the dead of the night,whisking them away in the dark if they turn around.No man is safe these four days and has to stay indoors in a total role reversal to what women face in metroes. The movie packs in an interesting and pertinent message in between the lines that women need affection and respect.As Rudra bhaiya ,the bookseller says,she is a change from the men ghosts as she seems well read as she reads\"O Stree kal aana\" on the house walls and goes away and she takes a man's consent before whisking him away leaving behind only his clothes.In other words,she is humourously referred to as a \"Nayi Bharat ki Chudail\". The cast is bang on.Raj Kumar Rao obviously is terrific ,just as he was in \"Bareilly ki Barfi\".He plays the charming and talented tailor,\"Chanderi's Manish Malhotra\" who can mentally measure a woman's size for stitching and has magic in his fingers. He puts up with an endearing performance especially when he has to look at the spectre lovingly! He is very ably assisted by Aparshakti Khurana and Abhishek Bannerjee ,who play his rustic buddies with a crackling chemistry.Abhishek Bannerjee with his part goofy grins and man possessed by spirit later puts up a good side performance.Pankaj Bhatnagar as Rudra bhaiya who knows everything about \"Stree\" is hilarious.His caller tune on his mobile \"Ye sama,Sama Hai yeh pyar Ka...\" named after his girlfriend ,Sama is one of the many humorous touches in the movie.Shraddha Kapoor looks suitably beautiful and mysterious as the girl who forms Rao's love interest and appears bizarrely from nowhere at times ,only on the four festival nights.She does keep you guessing about her identity till the end .The ending will definitely make you think and here is the part which leaves me a trifle unsatisfied...but it keeps the mystery on.Don't know if it is for a sequel. So the movie has a few jump out of your seat moments and this is precisely the reason I did not buy hot coffee in the interval! Songs by Nikhil Jigar are topical and more with the flow.If you want to watch an absolutely absurd song with skeletons playing guitars and Kirti Sanon dancing with the leads,the promo version of \"Aao Kabhi haveli pe...\" Is for you. Hence you have the ridiculous,the ghostly and the right message skilfully woven here for those who like their cinema different. I give it 3 and a half stars and my husband ,goes with 4 stars. Rashmi Sarkar"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "vishalthebachus",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "At par with bhul bhulaiya",
  "comment": "Good comedy. good scaresfdsa. you are a great writer and you are a good friend and you are a great person who has a lot of things to say about your business"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "garydivya",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "An unusually written horror-comedy combo",
  "comment": "A well directed movie combining horror and comedy in just the right proportions. Watch it for Rajkumar Rao's flawless acting, rib-tickling dialogues and unusual storyline."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "aditya-22125",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "One of the best horror comedy",
  "comment": "Best horror comedy as the acting of rajkumar rao, shraddha kapoor and other side characters are just perfect"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "aashish-sharma0786",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "STREE is a rollercoaster ride of comedy and horror.Don't miss it.",
  "comment": "STREE REVIEW.\n\nSTORY:\n\nIts a story of a witch who used to visit a village once in a year during festival to abduct men.Its inspired from \"NALE BA\" witch story of Karnataka.\n\nPOSITIVES:\n\nThis movie is hilariously funny and scary.This is a unique film totally unlike usual horror flicks as it combines multiple genres like comedy,horror & dark humour which is not commonly seen.The blending of comedy in between the horror storyline is perfect and does not look outlandish.STREE has some scary moments just because of good sound work and visuals.@amarkaushik direction is gripping and good.Casting is superb @rajkummar_rao expressions are so real and genuine.He is an asset to this film.@aparshakti_khurana @nowitsabhi comic timing and witty dialouges will give you good hell of a time.@pankajtri3 has done a brilliant job.His scenes and rao scenes are brilliant.@shraddhakapoor has done a justice to her role.Screenplay is engaging.\n\nNEGATIVES:\n\nRao,Aparshkti and banerjee friendship lacks depth.Confusion after climax was unnecessary.Climax could have been better.\n\nVERDICT:\n\nSTREE is a rollercoaster ride of comedy and horror.Don't miss it.\n\nOVERALL:\n\n3.5/5\n\nREPEAT VALUE:\n\nWatch it with friends only."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "nagsurajit",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "stree kal anna",
  "comment": "Great movie.sharaddha kapoor is osm.Everyone see the movie.What the acting?Sharaddha and Rajkumar is perfect choice."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "pnzrman",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good",
  "comment": "Absolutely it's a masterpiece.. best film of the year... It deserve 100cr box-office collection"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "potakavan",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Fresh Fantastic scary",
  "comment": "Much needed Fresh breeze to the bollywood. It was soul satisfying to see our own indian cinema raising its bars by touching the untouched risky genres of movie making instead of making the same boring easily earning old bolly masala waste of time. Loved the acting of all the actors. Screenplay, story, and direction marvellous. VFX are up to the mark. Hats off to the producers for investing on this risky scenario. It will be permanently inked on the board of indian cinema as the best effort of making Horror Comedy. Go watch STREE in theatres before other Masala films replace this piece of art."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "jainprasham33",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Amazing writing, good performances",
  "comment": "The movie is refreshing from the same old bollywood masala or seductive horror films. Great script and amazing acting performances (except Shraddha Kapoor). The writers have done an amazing job. Great dialogues. The script is tight with a lot of punchlines. Every actor in this movie has done justice to their role, landed their punchlines and have given life to these characters with the exception of Shraddha Kapoor. She is the single poor actor in this film. Completely unconvincing acting, poor dialogue delivery and blank expressions throughout. The movie has few messages which are nicely included in the script. Few subtle political satires as well. Few I remember include the cow problem in India, peacock tear reproduction statement by a minister, Aadhar card details leak, etc. The element of comedy attracts a much larger audience. Even if you don't like horror, this movie will entertain you."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "viddeshg",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Rajkumar Rao is phenomenal and Pankaj Tripathi is no exception.",
  "comment": ""
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "bhatnagardeepak-14016",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Darkest chapter in the Bollywood universe - Better than Nun",
  "comment": "I thought Vikram Bhatt was the only director left producing horror movies. Frankly his movies have not been what it used to be when he started off. After Ramsay bro's, he revived the almost dead genre. I watched Stree with no idea what its going to be. I have seen the best horror movies the Hollywood have produced and have hardly found myself looking somewhere else when it comes to jump scare. But boy o boy, post interval I was kind of covering my eyes and looking at my wife whose face expressions were changing with every jump scare scene. \n\nI don't understand why people have posted negative reviews. What do you expect? A masterpiece?? Sorry but Bollywood is not producing masterpiece lately. However, this movie have given hope that we still have directors and writers who know what they are doing. This movie had everything what a viewer expects. \n\nGreat job done by writer, director and actors. Don't get embarrassed when you find yourself looking towards your partner trying to avoiding to scenes. Respect her and hope she do not get inspired by Stree. \n\nI wish every **x offender and child molester meet there Stree someday."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "mycrazytop",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "best movie in long time",
  "comment": "Its a funny movie,acting is really great. the movie is based on a true event and the story is quite good.its not scary you will enjoy it"
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "shubhamgupta-01900",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "It's not horror movie it's comedy movie",
  "comment": "All the actor has played their role brilliantly. But they have made a comedy movie."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ankuragrawaliit",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A horror comedy done right!",
  "comment": "I had high expectations before going into this movie. All the media coverage had gotten me hyped and believe me you, I wasn't disappointed. I don't normally watch horror movies, solely due to the compulsive horror introduced at convenient situations. This was a different affair altogether and all the jump-scares were cleverly introduced which make this film even more enjoyable. \n\nRajkumar Rao and his friends have done a fantastic job in keeping the humor element intact and projecting the feelings of youth in a small village. Shraddha Kapoor is not at par but again, she had nothing much to do. \n\nDon't bank on the horror element. Watch the movie as a comedy and you'll love it ;)"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "aviks-44748",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome comedy horror movie.",
  "comment": "This one is truly an awesome movie. Enjoyed throughout. Rajkumar Rao is brilliant and once again he proved that he is one of class actors. Must watch. Similar to Bhool bhulaiya."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "archanatyagii",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Terrefic Movie",
  "comment": "Full on entertainment. Must watch. Fab acting from all the actors. I really enjoyed this movie. waiting for the sequel desperately."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "nitish-thebest-191995",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Not a perfect movie but an extremely entertaining one with a subtle satirical tone to it !!",
  "comment": "Just watched this \"one of a kind\" movie - STREE !! And God,what a blast we had !! Fast paced,completely involving,this one takes you on a ride of it's own!! One of the best,if not,the best horror comedy I've watched till date !! And I always love a baffling ending from which one can derive his own conclusions. Sensational performances by the entire cast,specially Rajkumar Rao as always ! It's not a perfect movie but completely serves whatever is expected of it !! Amar Kaushik is brilliant as director and Raj & DK are impressing me from Go Goa Gone to Happy Ending(as directors) and now Stree(as producers),I'm literally a big fan of their \"hatke\" movies !! Highly recommended,just go and watch this in the hall with your friends if you haven't,really not worth missing!! And I'm eagerly waiting for the sequel of Go Goa Gone and obviously Stree !! For now,enjoy this entertaining piece of work from this impressive director and the amazing producers who trusted this project !!"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "infoanup",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Low budget masterpiece",
  "comment": "Stree is movie that every startup enthusiastic in India should watch. Big lesson from this movie is that you can not solve every problem by throwing money at it. Even if you are low budget production house, you can still produce box office hit ( or greater RoI movie) by focusing on content and creativity. \n\nThis balance horror and comedy movie where lead actor Rajkumar Rao had played his role as per script. Director has also manged to keep movie for family audience yet kept enough interesting for young audience who enjoys subtle adultery in comedy movie. \n\nIf you are looking for a good family movie where you can enjoy the mystery of horror with smile on face. Stree is your easy pick for your next watch. \n\nEnjoy !"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "ankit-dutta07",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "An enjoyable one time watch",
  "comment": "I watched the movies without much expectation and wasn't at all disappointed. It was marketed as a horror movie but it tended to lean more on the comedy side. With some loopholes in the movie it would be advisable not to think much and just enjoy the punchlines. Also, the are some metaphorical scenarios shown where the roles of men and women are reversed and the insecurities of the women in real life situations are highlighted. This deserves special mention and the credit must go to the writers. Overall, a good movie to watch if you are going through a rough day and just want to relax.\n\nThis is the first Shraddha Kapoor movie I watched in a hall. Her performance was okayish and for the first I realised what a true beauty she is. Rajkumar Rao acted well, as always. Aparshakti Khurana also shows off his acting chops in a proper manner. He seems to have potential."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "jsha-71852",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Horror + Comedy! Great Combo",
  "comment": "After watching the tralier I was pretty intrigued and didn't knew what to expect. But this went way over my expectation,the concept was new it has a great cast and a great script. For the first time I was scared and even laughed like crazy in one scene. Great Performance by Rajkummar Rao. It's a very good movie, you should go watch it in a theater will its still there, its worth your time and money. Over all that its doesn't matter whether you're a kid or an adult you will be entertained."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "pankajroyroyroynroy",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Something different",
  "comment": "Awesome mixture of Horror and comedy! Loved Rajkumar Rao's acting. Jana was my fav character from the film."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "omi-19248",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must watch.!!",
  "comment": "Such a great movie with nice concept of both horror and comedy. From starting to end movie hold you with suspense."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "sgshivamgarg",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best Horror-Comedy in recent time",
  "comment": "Acting - Rajkumar Rao was epic as usual, Pankaj tripathi, Aparshakti khurana were also awesome. Shraddha kapoor did her job pretty fine.\n\nComedy - Best comedy movie in Horror-Comedy genre. Punches were awesome and was pretty clear from the trailer itself. Many double meaning/adult jokes were also there.\n\nStory - Storywise also the movie was awesome and did not lack story a bit\n\nHorror - Pretty good horror considering it was Comedy-Horror and not Horror only movie.\n\nMy rating - 10/10\n\nNote 1 - Don't go to watch with family. Note 2 - Stree >> Nun"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "singleim",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Perfect Comedy-Horror Movie",
  "comment": "I think no movie can beat the level of awesomeness this movie has reached. I have become a fan of Rajkumar Rao after this movie. Bollywood horror movie can be so spooky I never expected this. It passes a very strong message at the end which signifies women should be treated with love & respect."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "thelordmahesh",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Amalgamation of Horror,Suspense ,Comedy and Romance",
  "comment": "This is one of the gem produced by Indian Film Industry. It has everything right from humour to Thriller.The casting is perfectly suited from the Stree to Small roled. There is no flaw,everything is perfection, even small detailing.\n\nI dont know if I found the tune of famous Hollywood movie or others also did. Any guess when?\n\nIts suitable for all ages even though genre is horror. May be some scenes kids eyes should be closed but it doesnt last long and next we have funny scene..\n\nGo watch if havent.."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "rahul-lucky",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Horror with comedy is like cherry on cake",
  "comment": "Non stop balance mix of comedy and horror with good script with good acting. Must watch. Clean comedy but scary"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shivanisingh-05410",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Paisa wasul",
  "comment": "Must watch first amazingly scripted indian horror comedy movie... people who say its ending would be better can suggest the better way... coz i found its ending far better than other indian movies..."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "mayankmishra-57238",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A perfect package funny and spooky at the same time.",
  "comment": "'Stree' one of the best movies of this year. This movie will make you chuckle with hilarious dialogues. There are many jump on the seat scary moments. The cinematography is good with some amazing camera movements. Background score is very good and creates eerie atmosphere. Performances are great Rajkumar Rao and Pankaj Tripathi steals the show. Aparshakti Khurana and Abhishek Banerjee are outstanding, Shraddha Kapoor is good. Script is very bounding and written in the way that you will not feel bored for a moment. Director Amar Kaushik has done terrific job, he has perfectly observed Chanderi, and his story telling is awesome. This film also gives a great message, leaves some questions in your mind and a clear indication for a sequel. At last it is perfect package film and can be watched(Don't take kids with you they will be terrified)."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "sourya-mukherjee",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A refreshing family entertainer!",
  "comment": "If you are craving for a movie this season, which is hilarious and yet scary enough to keep you at the edge of your seat, Stree is a must watch. The story, though simple is intriguing enough. The songs in the movie are good and not misplaced. Direction is fantastic, dialogues are outright hilarious & the acting is outstanding. Rajkumar Rao's performance is beyond words. Shraddha Kapoor looks very beautiful in an absolutely non glamorous role and delivers a stellar performance. However, the icing on the cake are the performances of the support casts Abhishek Banerjee, Pankaj Tripathi & Aparshakti Khurana. The three of them make sure that even the scenes without Rajkumar or Shraddha Kapoor are as interesting or funny or tensed as the ones with them. Stree is truly a movie where team work wins.\n\nA perfect watch for the entire family, Stree is one of the best Hindi movies released this year. Must watch!!!"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "vikashprtp",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Very hilarious and awesome message too",
  "comment": "The time is really awesome in terms of comic timing of tremendous actors and it's have a deep message for society too.... overall it's totally fantastic movie which will definitely uplift your mood for sure"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "abhishekmenon-24560",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Hillariously horrifying",
  "comment": "If people start clapping after a movie is over, then it is a sure shot hit. This movie has definitely woken up our rarely used movie horror hormones. There are numerous hillarious moments and you have no time to even blink. Right mix of humour, horror and thrill"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "akashduet",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome movie",
  "comment": "Awesome movie. A perfect mixture of horror and comedy."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "hrishikeshranjan",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Songs",
  "comment": "The movie has very pleasant song which rejoice a persons mind and a great movie though"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "ahmdafeez",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good comedy drama and suspense movie",
  "comment": "The movie was great with drama and comedy with a good meaning and suspense great acting by Rajkumar Rao"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "deepakrakputdr",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "horror comedy",
  "comment": "Nice and awesome bollywood horror comedy movie and i suggest you to watch this movie and this movie contain full of entertainment"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "roy0512",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Fantastic movie!!! Great combination of Comedy & Horror",
  "comment": "Best Hindi Horror & Comedy movie of this year,Rajkumar Rao as as usual awesome acting, Sharaddha Kapor also nice appearance, every one should watch this beautiful movie..."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ijilaharshad",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Stomach pain due to combination of 3hr laugh and horror",
  "comment": "I love Raj kumar Rao and this was his best movie I have seen till date... I was full of humor and suspence ... The horror was perfect.. And wish to see its next part soon.\n\nBecause its ending was commiting itself that directore will surely ending on a note which promises of coming next year with more of Stree in some.different village"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ruchirarananavare",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A Rare, Self Aware Bollywood movie",
  "comment": "It was funny, nice, mysterious and like they claimed Horror-comedy! It did had any old cliche jokes. Refreshing and engaging the movie is. Among all the movies which come with a wrap of male chauvinism. This was a fresh air. Not loudly broadcasting but yet giving us feminism classes, like medicine wrapped in sugar. :') Especially the part where all males dress up and stay at home and say jaldi ana I am alone it's scary.. That's the feeling we carry always and they felt it .. amazing executed movie it was!! CAST : Stree ke Purus are superly intriguing to see..they have great chemistry which keeps you engaged! Loved them!!! Want to watch something funny .light. good content and very fresh! Watch it then!"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "saurabhkumar-53539",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must watch!",
  "comment": "After a long time I have seen this type of horrer comedy, rajkumar rao and pankaj tripathi totally nailed it, and Shradhha looks always beautiful..."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "kirtisalaye",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome",
  "comment": "Amazing movie! Haven't laughed so much in a long time!"
}, {
  "rated": "",
  "out_of": "",
  "userid": "shah-harsh1988",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Not great but not bad either..",
  "comment": "A mix of horror and comedy in first of its type for Indian cinema. It shall give you some jerks and laughs and sometimes both together. A one time watch for ones who enjoy horror as well as comedy."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "meghnasingh-15152",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Marvellous Movie",
  "comment": "One of the Best Movies that has been given to the Audience by Bollywood. Superb Script, Direction, Actors and Story line. One of the finest movies till date."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "sanantheking",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Climaxx is not clear cut",
  "comment": "Movie is more comedy than horror part. But still they didn't clear a climax in appropriate manner......Who is streee???........Shradhha kapoor(Actree)??? Or RajKumar rao's mother???"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "ishanmishra2001",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "\"Horror then Comedy\" not \"Comedy then Horror\"",
  "comment": "Well, a very innovative take on the Horror-Comedy Genre since 'Go Goa Gone'(Exec Producers are the same). Distinctive from the previous venture GGG, the Horror quotient in STREE is not for laugh purpose it's SCARY. Scary enough to give you a nightmare, the concept itself is very haunting. What makes the movie scary is the atmosphere, the Rural street of Chanderi it's hauntingly beautiful. A funny take on Nale Ba (Googled it)this movie has an interesting premise based on Karnataka Folklore urban legend. The Nale Ba concept itself has many possibilities, this movie could have been a very good Horror film. But Director \"Amar Kaushik\" has satirized the concept, The movie itself says based on 'ridiculous' phenomena. Comedy theme in the movies is not funny enough although it has a very great cast of terrific actors who have proven there worth in the Genre itself. Notable Pankaj Tripathi, Rajkumar Rao itself(See his response to Swayam Sevi from his dad it's hilarious), Also the Dixie Scott Scene and many more. Unfortunately, the notable comedy scenes are already mentioned in the Trailer. Disappointed to see Vijay Raaz in a small role, Hope the director make it bigger in the sequel. Acting part of the movie was very good, what makes it funnier is the Genuine reaction from the cast especially Pankaj Tripathi in the Jump scare scenes . In my opinion its a definitely must watch especially for a new/ Innovative concept from Indian Cinema."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "apratapsingh61",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "horrified comedy",
  "comment": ""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "ankurbisariyabbm",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must Watch",
  "comment": "Really a awesome movie. you won't get bored for single second. Being a comedy horror movie. It still keeps genre of horror maintained. Some scenes were too scary and on there other end you could die laughing. Please go and watch and keep the pain killer with you because \"Mard ko dard hoga\""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shivang-84619",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Movie dekho nhi toh stree aa jayegi ..",
  "comment": "Awesome movie ... One of the great horror comedy movie ... The movie was scary enough give u thrill & the scenes were funny enough to make u comfortable & laugh .. This movie is definitely worth your money.. Watch it... Everyone did a fantastic job. Loved the movie ...."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "ashusingh-88790",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Simply the best",
  "comment": "What a movie hat's off guys it's the best movie i have seen in bollywood in a very long time ! I just wanna say thank you for making and entrain us with a amazing movie like this. !! All characters are dope in all their respective roles ."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "bilalcoolbuddy",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome movie",
  "comment": "Excellent movie by amar kaushik, comedy and horror are exceptionally well balanced in the movie. To me it's the best attempt by bollywood in making horror movie yet. Background music and songs perfectly matches with the narration. And at last it was very nice to see how amar sir and stree team mock the men stereotype in the movie. Must watch movie #stree."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "mdashiqx",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "awesome movie",
  "comment": "Go and watch the movie ..... . . . . . . . . . . . . . . . . . . .. . .\n\n. .\n\n. . ."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "vikashjaivart",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A must see movie",
  "comment": "This film provides wholesome entertainment. One of the finest comedy films ever made in the history of Indian cinema."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "ritampaulchowdhury",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Not just a horror/comedy movie.",
  "comment": "Almost after 2-3 years i got to see a movie with a brilliant story line. Those who thought it is comedy/horror movie , i feel very sorry for them. The movie has very inert meaning in it. A very socio-emphatic massage in it. RESPECT WOMEN."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "kknkn-20823",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Outstanding",
  "comment": "Film is Outstanding... Please Watch movies Like This In Theatre... Leading Actress done great Job"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "himanityagi-49895",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "What a Marvellous Movie!!!!",
  "comment": "Horror+Comedy. It is very difficult to keep audience scared and make them laugh at the same time. Raj Kumar Rao evrytime creates a benchmark for himself by doing any movie. His performane is exceptional. However, each character is strong in itself: Stree, friends, Rudra, Shastri.. all. Nothing going overboard. I loved this movie."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "siddharthmay-943-187031",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "The Conjuring with Indian Tadka",
  "comment": "This movie is one of the best movies Bollywood has ever made with a perfect blend of Street comedy,Horror & suspense."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "rajkamal-79001",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must watch",
  "comment": "After so long..a full family entertainer...loads of laugh n horror makes it a perfect movie to watch.."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "prakharverma",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Maja aa gaya bhai log",
  "comment": "Sab dekho natural acting man too good after a long time such a great movie is released i suggest that everyone should watch."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "bhavya1221",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Sit tight enjoy New horror comedy",
  "comment": "Really I enjoyed through out movie..... Acting casting story all are good..... Enjoy your every penny"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "sdas-86953",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Rajkumar Rao .... the future of Indian cinema",
  "comment": "There was a time when bollywood was nothing except khans. And nowadays there is Rajkumar rao and pankaj tripathi . Man , what a performance by the two. It is also mention that the story of the movie is as fresh as Rajkumar's performance. I don't want to reveal anything , just go and watch the madness and horrorness of this . Great acting , direction , background music and screenplay ..... also the beauty of shraddha kapoor and location added the soul of the movie. 9 stars"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "manubhatt3",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "People who have little tolerance for or can't handle, ambiguity and lack of closure, may feel a bit disappointed and frustrated.",
  "comment": "Stree is a very novel and unique film. I am not sure if there is another Bollywood or Indian movie, which so clearly belongs to the 'Horror-Comedy' genre, and even if there is, I don't think this genre was ever so creatively and wonderfully exploited, as in this film.\n\nThe film has a very good, subtle and unique sense of humor. It's a laughter riot AND it cleverly and subtly delivers many social messages and commentaries.\n\nThe plot is satisfactorily complex and keeps you interested. Plus point is that the film is not very long(only 2 hrs. and 10 min.), so there are no moments where you might feel bored or uninterested.\n\nI should reiterate this : This is a very unique and novel film. So, in a way, it's a must watch. Very few, if any, films have ever been made of this kind.\n\nA key(good or bad, depends on how you see it) feature of the film is that it is very open-ended and ambiguous. Many things have been left without a proper explanation. \n\nI don't know what were the reasons for it; whether it was genuine or an attempt for a successful sequel. I personally, wasn't so much bothered by this - may be because I have already experienced this in many Hollywood films so got a bit comfortable with the idea. \n\nAlso, I don't know why, but I think that this ambiguity and improper closure, near perfectly fits the film and it's composition. It seems that the film was made for this. Anyways, it doesn't really take much fun away from already what's there."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "ansh_mody456",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "\"Mard Ko Dard Hoga\"",
  "comment": "Stree's storyline was new and most importantly good. This film perfectly describes \"horror comedy\" genre. Yet they could have done it better job in delivering the concept. As the ending was a bit muffled up. Good attempt though. Lack of \"good\" songs. (7.5/10)"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "umarsonic",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "One of the best Indian comedies of the past decade and one of the best movies to come out this year",
  "comment": "Stree directed by Amar Kaushik starring Shradda Kapoor, Rajkumar Rao along with other really talented actors is a movie I saw today and I absolutely loved it. In regards to horror comedies this has to be the best Bollywood horror comedy since bhool bholaiyan. This movie has a balance of terrifying and comedic moments in particular, Rajkumar Rao's performance was magnificent the guy's so criminally underrated amd over here he knows when to be funny and when to be serious. I laughed my ass off during the majority of the runtime. Also, the suspense built in the entire movie was phenomenal it kept me on the edge of my seat and then the ending happened and the ending of this movie is fantastic and truly unique. I will say however, that the songs felt misplaced and I didn't like the over abundance on fake jumpscares I give it a pass to an extent as this is a comedy but I hate fake scares in movies. In the end I'll say, Stree has it all comedy, horror, romance, a gripping story and is filled with suspense I'll give it an \"8.5/10\" and an \"A\" grade. Guys definitely check this one out its unlike most Bollywood comedies and is a truly terrifying yet hilarious experience."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "koushikd-10683",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Confused......whether to laugh or to become frightened",
  "comment": "Refreshing...........if you see it in a serious mode you'll definitely get scared at some moments of the film. But if you watch it in a light mode with friends around laughing at every point you may find it quite funny. But it is quite clumsy at some points......but yet refreshing. \"AAO kavi haveli pe\"....loved it !!!!!"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "srivastavkartik",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best acting in comedy genre....",
  "comment": "Rajkummar and all others are fantastic and its a real horror with a sense of humour. Best mixture of actors and script."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "kushalgupta-99908",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Paisa Vasool Horror Comedy",
  "comment": "What a beautiful movie with sweet message Rajkumar Rao Acting is Best Shraddha Kapoor Looks Cute Pankaj Tripathi Second Half Belongs to him This is the best movie of horror comedy"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "nishant205",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best movie in recent years",
  "comment": "This movie is best combination of comedy & horror."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "mrvaibhavpanchal-90401",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Great movie and storyline",
  "comment": "The movie has a very unique combination of humour and horror. I usually don't watch horror movies but I took the chances due to humour side.\n\nThe experience was absolutely amazing. We would need more movies like this.\n\nGreat acting by everyone. The focus was on the role and the story line than the superfluous 'superstar' charm.\n\nMy only criticism would be unnecessary songs. This movie being a modern Indian Cinema could easily do without showstopper songs.\n\nRao is amazing as always."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "amitchorge-46065",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Great Comedy Ride",
  "comment": "Watch it..great acting by R.Rao,pankaj tripathi,Abhisekh Baneejee"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "knpaulphoenix",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "10star movie",
  "comment": "Gr8 storyline.. Awsome wrk by rajkumar rao and shraddha"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ankitsaun-thekiller",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "One of the Master Piece of Bollywood:- Rajkumar You Are Great!!!",
  "comment": "One of the Master Piece of Bollywood:-\n\nCast - Rajkumar Rao, Shraddha Kapoor, Pankaj Tripathi Director - Amar Kaushik\n\nPreviously after watching trailer i though what kind of movie is this...definitely it will be boring movie. Then i read reviews and i made my mind to watch movies and i thought its a risk.\n\nThen i entered in theater its Monday and what the helllll....instead its Monday..show is housefullllllll....\n\nThen i got goosebumps and i realized i am here for one of the finest actor of Bollywood Rajkumar rao.\n\nMovie starts with comedy and i LOL like any thing. Then luckily audience besides me the 5 women's were like laugh too much loud like me...and every one in theater looking at us how the hell they can laugh so much loud??? And then they also started laughing.\n\nThen suddenly horror scene came we were screaming out loud then again comedy then again horror...and movies keep going like this.\n\nStory :- Very ordinary people but extraordinary story. Fresh concept never tried in Bollywood.\n\nDirection :- Amar Kaushik you nailed it....its one of the best directed movie of Bollywood....beautiful.\n\nScreenplay :- Its just awesome....Beautifully crafted...and you will never felt bore while watching movie. You will get goosebumps and you are just inside the movie.\n\nMusic :- Music is average but while watching movie...you will find it very creative and beautiful.\n\nActing :- Rajkumar Rao Nailed it...Shraddha Kapoor descent acting...and each and every character just acted superb and left impressions in your heart\n\nAt last once movie will over....you will think why the hell it got over??? You wanted to watch it more and more and more.\n\nAnd movie teaches you to respect Women. What a different way to present\n\nJust loved this movie...every one must watch this....Best movie of 2018...best movie of all time.\n\nStree Kal Aana to Stree Humari Raksha Karna!!!!\n\n4 out of 5 Stars"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "gandharvbhoot95",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "#NayeBharatKiChudail",
  "comment": "Stree literally feels like a breath of fresh air coming straight from the streets of Hindi film industry. Interesting plot perfectly 'stitched' with a gripping story and quirky characters. From casting to dialogues to cinematography all work to their best. It's a blend of both goosebumpy horror and rib-tickling comedy. Raj & D.K.'s Crispy script, Amar Kaushik's superb direction, Rajkumar Rao's range to his craft, Pankaj Tripathi's flawless comic timing, Aparshakti Khurana & Abhishek Banerjee's blossoming freshness, Vijay Razz as a surprise and Shraddha Kapoor's mysteriously mesmerising appeal just shines bright on the screen, except for the issue of unwanted twist in the climax. This movie does all justice to its genre unlike the trash (Golmaal Again & Great Grand Masti) that we've been offered in the name of \"Horror Comedy\"."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "nidhineema",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Perfect blend of Comedy and Horror!!",
  "comment": "Nice story, plot and Fantastic acting by actors. A fun with scary drama to recall the basic right of women - live and respect. No forced comedy, perfect timings. Also demonstrates Indian mythology associated with scary horror stories related to evil spirits."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ranvijaysinghrajawat",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "An awesome horror-comedy movie after Bhool Bhulaiya",
  "comment": "\n\n"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "sourabhauthenticmundra",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Horror and comedy fusion worked very well",
  "comment": "It is definitely a worth movie to be watched in theatres, the timing of dialogues is superb and horror and comedy both are shown in equal amout Rajkumar fits in every role he takes and special mention would be Pankaj Tripathi for this movie"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "rashirounta",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "SEQUEL, #RKR N CONGO for 100 crore success!",
  "comment": "Dinesh Sir.... watching this movie 10th freaking time in Theatres just to get a hold of the last shots!!!!... S E Q U E L please...and With same cast please Sir... Please!!!"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shubhamchandere",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Didn't expected this from bollywood",
  "comment": "Story - 100% (Feels like grounded hence connects to us) Acting - 100%(Rajkumar Rao & Pankaj Triphati are great as always.) Horror - 95% Humor -100% Direction- 100% Hollywood had almost all of the best Horror Movies and waited for great Horror - Comedy but this movie was surprise for me."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "virajstone",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Fantastic!",
  "comment": "Rajkumar rao and all co stars made a great performance with entertainment and comedy . Though the topic was of ghost but genre in the movie was all mixed and this made movie excellent. Outstanding movie"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "muffadalchittalwala",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Stree A Fresh Attempt by Bolywood , Horror Comedy Worth Watching",
  "comment": "Based on ridiculous phenomenon, where men in town are told by mother sister & wife to not to roam on road at night, as witch of modern india is on hunt on 4 festival nights."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "nikunjmarakana",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Nice movie",
  "comment": ""
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "yuvraajbarsaley-06635",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "HORROR - COMEDY GENRE IS REALLY AWESOME !!",
  "comment": "THIS IS A MOVIE BASED ON A SMALL TOWN OF CHANDERI ..... IT IS HAUNTED BY A GHOST NAMED STREE !! SHE ONLY COME DURING THE FOUR NIGHTS OF PUJA !! AND SHE ONLY ATTACKS ON MALES .... FIRST, SHE CALLS OUT THE NAMES ... THREE TIME !! IF ANYONE TURNS AROUND SHE ATTACKS HIM AND TAKES HIM ALONG WITH HER ... LEAVING HIS CLOTHES BEHIND ..... THIS MOVIE HAS A REALLY GREAT STORY !! ACTING AND COMEDY WAS DONE REALLY WELL BY ALL OF THE ACTORS !!! SOME OF THE SCENES CAN HORRIFY YOUNG CHILDREN AND THERE ARE A LOT OF JUMPSCARES IN THIS MOVIE !! THE PLOT IS TAKEN BY A REAL LIFE INCIDENT THAT TOOK PLACE IN A TOWN NEAR BANGALORE IN 1990's AND THERE ARE ALOT OF TWISTS AND TURNS WITH SUSPENSE !! YOU CAN GO TO WATCH THIS MOVIE !! I WILL NEVER BORE YOU ..... JUST ENTERTAINMENT !! I LIKED THE MOCUE SO MUCH !!"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "aswincu",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A good commercial movie with a deeper insight.",
  "comment": "The movie revolves around a ghostly character \"Stree\", a woman who was supposedly wronged by the \"men of the village\", extracting revenge by abducting the men and killing them. Stree looks for love in the eyes of her victims but sees nothing but lust. This character is not necessarily a villain but something that want people to change their ways and treat woman with respect and love (PS: personal view). The attempt however seems futile until our hero comes along. In a way the movie revolves around the increase in atrocities towards woman in the society (not directly implied in the movie) mixed with humor associated with a young man's life so that things don't get too serious."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "sandeeponthenet",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Fantastic movie",
  "comment": "Superb acting, superb comic timing, superb (and awkward) story... what else do you want from a movie? I enjoyed the movie and think you must too. Worth your time and money."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "amar13493",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A good comedy horror bollywood been waiting for since Bhool Bhulaiyaa.",
  "comment": "This movie will grip us from start till the end. Everyone in this film acted well. Rajkumar Rao the protagonist in the movie acted very well his expressions in the movie and comic timing was awesome just like his other films, Shraddha Kapoor did just fine, other actors like Aparakshakti Khurana and and Abhishek Banerjee Completely justified there role With excellent comic timing with good punches but our real attention was grabbed by Pankaj Tripathi from his entrance in the movie till the end. There is an special appearance in the movie of Vijay Raaz he was an eye catcher. For a comedy movie funny dialogues are important but good timing of dialogues delivery is also important. This movie is wholesome entertainment with a good story and with a message in the end. Overall 8.5/10"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "neeljosh",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A great entertainer with a strong social message",
  "comment": "Stree is an amazing horror-comedy with the actors making a significant contribution to the reasonably well-rounded story. The timing of comic scenes is perfect and that keeps the movie from ever getting boring; when there is no comedy, there is either horror or an interesting/important plot point. Rajkummar Rao, Aparshakti Khurana, Abhishek Banerjee, and Pankaj Tripathi have brilliantly delivered the comic punches in their unique and amazing way. I say the story is reasonably well-rounded because it seemed possible for the story to deliver a few more necessary plot points - not mentioning the specifics because I don't want to spoil it for you all - in place of a few comic scenes, which were mostly hilarious, nonetheless. The set up in the movie which completely reverses the man-woman situation in most of India, especially when it comes to roaming around freely at night, adds to the comic nature of the movie. The set up also conveys an important social message, which is women and men are effectively equals and women should be treated as such."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "maaz-52662",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must Watch.",
  "comment": ""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shabbar-marvel",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Best horror comedy ever",
  "comment": "Never seen before genere where u laugh,fear and thrilled at the same time.had really really great time with smartest comedy made by india."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "jaygohil",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Rajkummar is unstoppable",
  "comment": "A perfect Horror-Comedy feature film for Bollywood."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "yashdengre",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Nice Movie - Must Watch",
  "comment": "Overall movie is very good. Casting : Perfect People for each characters. Acting : Each and everyone did great job. The best part is when they introduced Vijay Raaz. Music : Music is nice. Direction : Yeah well executed. I would really recommend each and everyone to watch this movie."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "payalts",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A new genre in Hindi cinema",
  "comment": "Entertaining, delightful, frightening all at once. Stree is a lovely combination of horror and comedy, a mix not attempted before. Horror without gore, crazy make-up or sexuality. Comedy without cliches, over the top characters and crass jokes. The movie keeps you engaged till the end. Finally, a Hindi movie that I enjoyed to the core. Excellent work by the entire star cast. Kudos to the crew for giving us this gem. Well done!"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "mitasikand",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A must watch!!",
  "comment": "Excellent story telling, extremely gripping and hilarious movie..a must watch"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "saraswat-dhoom2",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Superb Combo of Horror n Comedy",
  "comment": "Stree: \n\nBased on a ridiculously true phenomenon as the movie starts we see this note. As we proceed we come to know about the phenomenon being said above. Stree is new kind of Horror cum comedy genre movie . It's a delight to watch the actor playing interesting characters in the movie \n\nStory is about a small villege Chanderi in MP where every year there is some festival which is for 4 days and during these days a witch or Chudail who people of village calls Stree hunts and takes away men who are out of their home. Vicky (Rajkumar Rao) a famous tailor in the village meets Shraddha Kapoor who visits the villege only at the time of this festiva. Later on Vicky and his friends Bittu (Aparshakti Khurana) and Janak (Abhishek Banerjee) come to face this Stree and then the fun of comedy and horror start.\n\nThe story is different and has some freshness and feel in it we have never gone through . Actors in the movie has done a very very good job and the team of actors is also brilliant. It also includes Pankaj Tripathi as Rudra who when ever is seen of the screen gets a hooting by public . The there is a small role of Vijay Raj who makes his presence felt . Abhishek Banerjee & Aparshakti Khurana has also done a very good job. Rajkumar Rao aa always is the best man in the movie and so is Shraddha.\n\nDirection and background score is also very good which makes it watchable and there is not a single moment which makes it boring. For a different taste lovers and comedy lovers this is a must watch."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "VeeHarshu",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome must watch movie",
  "comment": "This movie is a laugh riot from start to end with few spooky bits to scare you as well. Rajkumar Rao's acting is superb. Fun movie to watch with friends and family."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "sohilgargsg",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Must Watch",
  "comment": "The story of the movie is outstanding and unpredictable. Acting was upto the mark and a nice message conveyed through this movie. So must match."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "soumyadipsaha",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "One of the best horror-movie I've watched ever...",
  "comment": "Brilliant picturisation, brilliant direction & screenplay which maximum Indian horror movies lack; Stree has everything as a horror movie. Not only horror, the movie shows perfect comic-timings of Pankaj Tripathi, Rajkummar Rao, Aparshakti Khurrana, Abhishek Banerjee & surprise-package Vijay Raz. Shraddha Kapoor has done her best. Also, this movie teaches us about the true love & respect that every Indian wives want. So, if you love some social message wrapped with entertainment; (also some thoughts that will not leave you after ending) this movie is certainly for you. Sachin-Jigar mastered in creating some horror feelings by background music completely. Overall it is a worth-watch. I just loved it."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "killertapas",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Appears that sequel would be come....",
  "comment": "Interesting movie leave behind a question in mind whether sequel would be come in future or not. Overall one time watch movie with cautions as adulterous meaning used."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "jadavchaitanya",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Full of entertainment",
  "comment": "One of best original script & direction. Rajkumar Rao played magnificent role. But it was like comedy > horror"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "praseneo",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Wonderful",
  "comment": "Best movie of the year. Just awesome.love this movie."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "gvgupta",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A must watch movie.. It Makes you feel frightened but at the samr time it makes you laugh. And acting of each and every actor is superb and the mystery of Stree continues..",
  "comment": ""
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "sumertulsyan",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Entertaining movie!!",
  "comment": "I would categorize this movie in the comedy genre while there are some horror scenes and they are also very well shot which can make you jump out of your seat suddenly. Pankaj Tripathi seems impeccable. He will make u laugh everytime he speaks. Rajkumar Rao is again proving his mettle with his acting skills. His accent and comic timing is superb. All others actors have also done very well to make this movie worth watch.\n\nThe story of the movie is not that great in my view but it is their acting and direction with which movie is made are too good. They are also very successful to convey the message that this society needs to stop treating women as object and should give respect to women which they deserve.\n\nAt last, a very good good entertaining movie. WORTH WATCH!!!"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "sanakmajumdar",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A very funny and important film",
  "comment": "Stree above all is a brilliance of writing. Writers Raj Nidhimoru and Krishna DK the right notes and have made a spooky yet charming and hilarious film about a spirit named stree who abducts men, but only after taking there consent. The film works on three levels one being a a nice horror film, second being a genuine comedy with clever lines, and the third and the most important being a satire on the conditions of women in India. We have seen the satire films not working previously like 'Bangistan' but stree doesn't hit a false note. The actors are all at the top of their game. Pankaj tripathi, Aparshakti khurrana, Abhishek Bannerjee all are perfect for their parts; Sharaddha kapoor is perfect as this mysterious woman whom Vicky's friend consider to be the 'Chudail', and everyone know the Rajkumar Rao can do wrong ever; I MEAN JUST GIVE HIM ALL THE AWARDS."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "akshayrathi-34368",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "It's a must watch.",
  "comment": "Rajkumar Rao, Shraddha Kapoor and All the others actor did a fantastic job. The believes like worshipping god and people trying different ways to protect themselves from \"STREE \" are shown very nicely. One of the best thing is the horror scenes at the unexpected moments. The director did a commendable job. To sum up, It's a must watch"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "mah47",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "O Stree Kal Ana \"Full Spoiler\"",
  "comment": "\n\n"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "arshadmadiha",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "128 Mins of Entertainment Bonanza",
  "comment": "The contrast of comedy & horror is very well thought out and executed. This see-saw keeps you hooked until the last moment. The Social Satire is subtle but hits all the right cords. The depiction of modrenity's arrival to Indian hinterland, its people and their emotions is seamless. Thumbs up."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ravimech-83710",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Worth movie to watch",
  "comment": "Nice thriller comedy movie to watch after so long time."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "yashpani",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Fresh breeze of Entertainment",
  "comment": "Story: Very gripping , especially the 2nd half. Holds u at the edges of ur seats. \n\nHumour : Out of the park. You'll find hard to breathe as the movie is full of laughs n shudders. Geniusly placed punches and one liners, mostly desi humour .\n\nScariness: You'll laugh with fear, and will be scared while giggling.\n\nActing: Full marks to Rajkumar Rao. Bollywood is blessed to have him. Supporting cast is also as effective. Such natural acting.\n\nClimax: Very unusual. You'll be left surprised. Quite unpredictable and impressive writing this .\n\nSongs: Milegi milegi is fun. Kamariya is average.\n\nOverall verdict: Rare masterpiece filled with desi content and humour. Rajkumar is on fire. Go watch it with friends and family. You can watch it multiple times. I did. Kudos to Amar Kaushik ,Abhishek Bannerjee & Raj Nidimoru for such excellent writing, screenplay and casting ."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "lal-21573",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Average story but very good acting...",
  "comment": "Horror and comedy go neck to neck in this movie...Which is surprisingly awesome.... Expressions of Raj Kumar Rao shows what real acting is. Storyline of movie is average but it is acting of all character that makes this movie awesome......Further you can watch with your whole family."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "mehulj-21215",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "#Worth It",
  "comment": "Good start, pretty horror best horror movie(Hindi Cinema) till now. Moral and thought provoking. And the end unique. A twist in the end that gives you space to think. A new way in Bollywood. Some might not digest. From my side, good job team. Acters were natural and awesome. Couldn't have done a better job."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "ajhavery",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Good entertainment, but disappoints with ending",
  "comment": "The movie is a good mix of horror and comedy and the performance of actors is commendable. However, the movie fails to give a proper ending. The whole of movie revolves around adding fun to finding methods to overcome the horror of stree, and it ends around trying to build a message of women support and empowerment in last 15 - 20 mins which leaves people to interpret for themselves the take home message."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "sayanmitra-62740",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "awesome..",
  "comment": "Superb movie..loved it..very nice acting by all actors.. good combination of horror and comedy..a must watch movie.."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "anshul2001anshul",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A truly indian horror movie",
  "comment": "Takes from Indian folklore, has not been churned by some factory making horror movies as many typical small Indian town things have been captured. Though ending is not very satisfactory and how boys are transported to old fort is not explained still one of the best Hindi horror movie ever made"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "chouhanankit-25842",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Star cast where every character had done a terrific job.",
  "comment": "A terrific movie overall, with a punch of everything in it be it comedy, horror, a bit of romance, funny dialogues, comic timing of all the actors, and super songs. Rajkumar rao impresses yet again this is much more then the expectations, you won't get to watch such movies daily or even in years so don't miss this ride with full of fun, laughter and also horror."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "navneetkaushal-98090",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "A good comedy movie after a long time",
  "comment": "This movie needed to be watched..the horror scene will give you creeps and comedy scene will make you laugh so hard that you will get tears in your eyes while laughing a must watch movie.special mention: Raj Kumar rao. I think he is a genuine actor."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "niks-91614",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Awesome",
  "comment": "Watched first day first show... I really loved this movie. Very few indian films try horror comedy... But trust me it work.. this film proved it... Rajkumar Rao best act in comedy after bareilly ki barfi. Shraddha is mind blowing... I mean just watch the end... You'll know what I'm trying to say... Direction is fantastic. Locations are nice.. And yes sequel is on its way... Eagerly waiting for it's sequel..."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "chiragtyagi-43558",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "An Awesome Horror comedy Watch!!!",
  "comment": "Great moviee.....not a big horror comedy fan but this proves me wrong.....great movie.....music was decent ......performance was superb all of the caste....shraddha surprises big time.....and best part was background score during horror sequences!!!!! 4/5 from my side...."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "abhay-45287",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "So Good! So new!!",
  "comment": "Its a must watch movie . Well written and well played . Choice of cast was brilliant ."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "mia-86857",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "The best of both worlds - horror and comedy!",
  "comment": "To say Stree is just a movie would be a gross injustice to the makers and the actors. I personally feel it was an experience in itself, for never before have I found myself simultaneously feeling both terrified and tickled, and judging by the guffaws and screams in the theater, am pretty sure nobody else did too.\n\nNothing in this movie, from the story (with elements from the erstwhile Bangalore-based Naale baa ghost) to the red-clad, neatly dressed, bindi wearing ghost to the whiff of feminism and respect for women is conventional.\n\nIn a time when directors aren't able to get one film genre right, director Amar Kaushik manages to blend in two very different and difficult genres, horror and comedy, to great success, much helped by the script, written by Raj Nidimoru and Krishna D.K. The writers skillfully insert humourous dialogues in the most frightening scenes, and break the tedium of horror, that if left unchecked, would probably make the film a painful, predictable watch.\n\nFor me, Rajkummar Rao is the new-age Aamir Khan - there is no film of his where he has done a bad job, including the boring Shaadi Me Zaroor Aana. As Bittu, the \"Chanderi ka Manish Malhotra\", Rao is gullible, sincere and as conflicted with his emotions as the audience are with theirs' as seen in a scene where he has to profess love to the ghost, while trembling with fear. Rao gets immense support from his co-actors, Aparshakti Khurrana and Abhishek Banerjee, who play his friends Bittu and Jana respectively. Banerjee especially does a brilliant job after his character alters completely in the second half of the film #NoSpoilers. Shraddha Kapoor is satisfactory as the mysterious, quiet girl who Bittu falls for. \n\nI petition Filmfare and the National Film Awards committee to create a special category called Best Character Actor Award in 2018, and give all the awards to Pankaj Tripathi. Mashallah, what an actor! As the self-declared omniscient village elder Rudra bhaiya, Tripathi flaunts his fluent Hindi (nimnalikhit niyam, anyone?), squats on the ground in fear and says the most tee-shirt worthy dialogues.\n\nThe film's flaws - a slow first half filled with unnecessary songs, an even more unnecessary touchy-feely-romantic moment etc - are quickly forgotten by the time the film ends. Two points about the film left me thinking though. One, how, despite reeking of values such as respect for women, there are less female characters and two......has the film encouraged the word \"stree\" to be used interreplaceably with the words \"chudail\", or was it the opposite? But that's what happens when you watch a film - for the lack of anything better to think about, you ending up reading between the lines and driving yourself nuts!\n\nVerdict? Just buy your tickets now and watch the film!"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "siddhantlal",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "rollercoaster ride of horror and comedy",
  "comment": "Stree really take you to the rollercoaster ride of horror and comedy. A great storytelling, great performances and humour. It take you to the streets of urban legend and mesmerizes you. Great work by director and awesome sound effects. Some scenes really gives you goosebumps. A cool and excellent genre. One should really watch this movie of a new style."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "srjbrs",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Mesmerizing Bhootiyappa & Comedy",
  "comment": "Amazing.... Waahhhhh.. wow... Superb.. beauty... Sexy"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "ketgup83",
  "helpfulness": "0 out of 0 found this helpful",
  "title": "Leave everything and make sure you watch it !!! Highly Recommended !!!",
  "comment": "There are movies which you are eagerly awaiting after watching the trailer and then you will fall in love after seeing the movie. Stree definitely falls into this category.\n\nStree tells the story of a small town Chanderi, Madhya Pradesh which is gripped by fear of a witch, Stree, who kidnaps the men to quench her thirst for love.\n\nDebutant director Amar Kaushik chooses a subject which is fresh and interesting. Written and scripted by Raj Nidimoru and Krishna D.K., Stree is the combination of horror, comedy and philosophy. There are few scenes which are thrilling and creates tension, thanks to the wonderful haunting background score. Though Stree is full of humor and entertainment, it successfully deals with social message of how women should be treated equally and what can be the future if men becomes unsafe in India. The first half is full of hilarious moments and will make you curious while the second half is even more better. The interaction between Pankaj Tripathi, Rajkummar Rao and Aparshakti Khurana at his house researching for the witch, the scene where Dana is consumed by spirit and tries to hurt Rajkummar Rao in the corridor and the climax scene where Rajkummar Rao is looking into the eyes of witch and says the dialogue, will bring down the house.\n\nOn the flip side, few songs could have been avoided and length of the film could have been trimmed by few scenes. Dialogues are smartly written while the art direction and cinematography is decent. Performances by the everyone is one of the highlight of the film. Pankaj Tripathi is a treat to watch. Check out his mobile ring tone which matches with his spouse's name \"Shama\". Aparshakti Khurana does well and so does Abhishek Banerjee, who plays Dana. Shraddha Kapoor looks gorgeous and shines through out her role. At the end of the day, Rajkummar Rao is the show-stopper of the film. The actor is so easy to watch it. The supremely talented actor will convince you to believe in his portrayal of Vicky.\n\nOverall, Stree is one of the best horror-comedy film to ever come out in Bollywood. Highly recommended 4/5"
}, {
  "rated": "1",
  "out_of": "10",
  "userid": "samaustin-59525",
  "helpfulness": "3 out of 8 found this helpful",
  "title": "Worst movie ever",
  "comment": "It was a slow movie and I had the worst experience while watching it. Could have been better. Ending was lame!!!!!!!!!"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "aniketsulejodhpur",
  "helpfulness": "3 out of 8 found this helpful",
  "title": "Funny, frothy and weird",
  "comment": "The movie has a talented star cast in Rajkumar, Aparshakti, Pankaj ! They have good chemistry and never fail to laugh at their own stupidities. Movie is set in a charming small town of India with its history and folklores. The chemistry between the lead pair is non existeny. Shraddha Kapoor needs to take some time out and take a hard look at the fact that she doesn't know acting and maybe she is better suited for some other profession. The director and script writer shine through and through. Barring the last 10 weird minutes of the movie. It's a pleasure to watch. The ending leaves you irritated."
}, {
  "rated": "5",
  "out_of": "10",
  "userid": "pspareek",
  "helpfulness": "4 out of 13 found this helpful",
  "title": "O Stree Kal Aana...we will watch Bhool Bhulaiyaa together",
  "comment": "While Stree has it's moments, it suffers from the lack of a sucker punch a movie of its genre needs to deliver by end. The biggest problem is that the Stree despite all the CGI, doesn't evoke the same level of terror that Vidya Balan's Monjolika generated with her weird make up and Bengali. First half is decent and gives enough time for character development however I would loved some more screen time for Pankaj Tripathi. He seems wasted for a role comparable to Professor Agni of Raaz. Rajkumar Yadav is funny but the show stealers are the side kicks and their banter. Shraddha Kapoor speaks with her eyes but leaves several open questions by the end of it. \n\nThe real let down is the second half especially the climax where it seems the director was in a hurry to find a solution as he was rushing out of stock. So instead of a thrilling culmination, the movie manufactures a tepid ending and you are left craving.\n\nSo unless you are getting cheap tickets I would suggest wait for this one till it's available on DVD and till then if you want to get genuinely confused between whether to laugh or to get scared, watch Monjolika and Rajpal Yadav in Bhool Bhulaiyaa."
}, {
  "rated": "3",
  "out_of": "10",
  "userid": "sharmavardhan",
  "helpfulness": "3 out of 9 found this helpful",
  "title": "Lame",
  "comment": "Trust me on this but I do not understand why this movie was so hyped. I mean I do understand that Rajkumar Rao is a brilliant actor specially after I watch the movie Shahid but this is just a very weird movie. I do not understand what genre was this entire movie based on. Horror/Comedy it wasn't either of them. The jokes that were cracked failed to amuse me. The movie failed to scare me. So I really don't understand what basis the movie had. There are people who would love this movie given that it does have sort of an interesting storyline but then on a more practical level this movie was a disappointing."
}, {
  "rated": "1",
  "out_of": "10",
  "userid": "aaronfernando",
  "helpfulness": "2 out of 5 found this helpful",
  "title": "Stree watched only coz for rajkumar rao",
  "comment": "Wht was there to be horror here . No story line proper . Just was film of marketing nothing else . Background was nice in this movie"
}, {
  "rated": "1",
  "out_of": "10",
  "userid": "harleenkarora",
  "helpfulness": "3 out of 10 found this helpful",
  "title": "Where's Indian cinema heading!!!",
  "comment": "Horror or comedy? Does justice to none. Poor script poor direction and even poorer logic. Self condemn n criticise the script and try to escape the stupid logic. Cheat public and declare a sequel. Rajkumar Rao says that the so called bhi it stree is so educated to read the slogan' stree kal aana' and obeys it! (Self criticism) Shradha Kapur fights the stree and in the end she joins the cut choti to her hair depicting herself the stree!!! Absolutely cheating the audience without any conviction."
}, {
  "rated": "5",
  "out_of": "10",
  "userid": "gaganbtl",
  "helpfulness": "2 out of 6 found this helpful",
  "title": "What i felt about the movie",
  "comment": "Well i hv seen the movie today after reading so many positive reviews. Well its not a bad movie but certainly not 8 or 9 out of 10 kind of a movie. There r many moments of laughter mixed with fear but overall when the movie finishes so many questions left unanswerd."
}, {
  "rated": "5",
  "out_of": "10",
  "userid": "shailendrakharwas",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Boring movie",
  "comment": "One thing I like about this Movie is The motive of the Stree, throughout the movie no fun at all."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "singhprakharsainik",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Contently Balanced",
  "comment": "Nice...one time watch movie. There is never a moment when you are not laughing."
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "beevenkat",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Is she just an illusion",
  "comment": "So who exactly is #Stree? Is she just an illusion? Or is she a woman wronged? Whys she visible only during the yearly festival in chanderi? Is she in search of love n dignity? Was she murdered before she could enjoy her suhaag raat? Why r men scared of her? Did they disrespect her when she was alive? How can she be restrained? Good performances by rao, khurrana, banerjee n tripathi. Some scenes n dialogues r funny. Running time should be reduced by 20 minutes. Rating 3/5."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "jatinschhabriya",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Thoroughly Enjoyable Horror!",
  "comment": "I would never imagine myself enjoying a movie that falls under Horror category....and is also a Comedy....and that's not it, it's also shot in India and is in Hindi. I thoroughly enjoyed Stree! Much like her real-life persona, Shraddha Kapoor plays the role of a peculiar girlfriend who is full of surprises and Rajkumar Rao shines in the spotlight just as he has ever since 'Trapped'. Don't let the U/A tag kid you - this movie has a horror that would make you sit on your palms with a lump in your throat and scream! The cinematographer crafts a canvas that would leave you looking over the back of your shoulder for nights at stretch. The characters fall into their roles flawlessly which is definitely the most impressive feature. As if it's not enough, the whole movie revolves around an (otherwise common) social message that gains full glory thanks to the skill with which it's unweaved! Be assured that by the time the credits roll, even the intelligent ones would be left with several streams of doubt that would leave you amused, waiting, wondering..and hoping for an early sequel!"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "hardik_raychanda",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "fun horror ride..!!!",
  "comment": "After directing and writing a zomcom Go Goa Gone, writers Raj DK are back with Stree - this time the direction is given to a debutante.\n\npositive points of the movie - superlative writing, crunchy one liners, crisp plot, awesome performances and perfect bgm. negative points of the movie - none. repeat value - definitely yes\n\ntotally refreshing movie. a must watch."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "sushantshinde51",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "She is coming...",
  "comment": "Stree (A Woman - in English) is a comedy horror film directed by Amar Kaushik and produced by Dinesh Vijan and Raj and D.K. The film is based on the Indian urban legend about a witch who knocks on people's doors at night.\n\nThe film sets in the strange and small town of Chanderi, which is haunted by a ghostly woman named 'Stree', who abducts men during the nights of the festive period. The film opens with a tagline saying, \"The film is based on the ridiculous phenomenon\", and yes, as the topic of the film is completely fresh and unusual, it successfully delivers the same. The film revolves around Vicky (Rajkummar Rao), a skilled tailor in a town, who falls for the mysterious girl (Shraddha Kapoor), who also only appears during festival season. As the festival starts, Vicky's close friends start disappearing, which makes him set out and confront the 'Stree' and bring his abducted friends back, with the help of librarian Rudra bhaiyya (Pankaj Tripathi), who has analyzed the myth of evil spirit 'Stree'.\n\nAs the film's trailer had suggested the film is the really good combination of its comedy and horror aspect. This type of combination was previously seen in Go Goa Gone (2013), a brilliant horror comedy film, which was directed by Raj and D.K, and Amar Kaushik was on the assistant director's team, so the same flavor of comedy can be seen in Stree. The film is a mixture of satire, dark comedy, and ample but impacting horror. Along with all these elements the film also talks about a common woman's condition in India and gives a clear message that all women should be empowered and respected and should be considered as a powerful human being as men.\n\nThere are some jump scares in the film, which with the screeching background score and subtle visual effects works really well. The performances are top notch, every single character in the film gives the outstanding performance. Rajkumar Rao and Pankaj Tripathi are among the proven talent pool of the industry and they actually steal every scene they are in. It's not a perfect film, the film feels a bit longer at some places, and there are some flaws and loose ends, but those can be expected in its scheduled sequel."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "n_bhagiya",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "A benchmark for horror comedies to come !!",
  "comment": "Amazing film with just the right amount of humour and horror...it scares you and makes you laugh at the same time and also gives a very good message without being too preachy... it has become a benchmark in the Hindi cinema so that more films in this genre come out in future..."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "sumitthalder",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "A nice Horror Comedy Movie",
  "comment": "Stree gives you short hilarious tour of what happens in some of our Indian villages, it shows how people follow myths blindly in an hilarious way. It also has few horror jump scenes. Although I feel like movie has an unfinished ending or has missed few things in the end, still it's a good movie and worth watching."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "mayankdixitt",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Good Watch",
  "comment": "The movie manages to be scary and funny at the same time, The funniest character in the film is Pankaj Tripathi's character Rudra, a Mr. know-it-all, who guides Rajkummar and his friends on how to cope with Stree and her haunting act. Pankaj Tripathi's comic timing is top notch and one of the key highlights of the film. Rajkummar's performance is also superb. He handles the many shades of comedy, horror, and romance very well. Horror comedies are a rare offering in Bollywood and in that respect, Stree serves up a lot of thrills and spills. Good movie, one-time watch."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "sridhar-e",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "A horror film which is a laugh riot",
  "comment": "\"Stree\" is a wonderfully weird movie. It's a very well crafted horror- comedy where neither genre overpowers the other. Every actor shines throughout the film except Shraddha Kapoor. Special Kudos to Rajkumar Rao and Pankaj Tripathi. An award winning effort by the dialogue writers. The story could have been better and there are quite a few loopholes. Also the ending is really weird but overall this movie will keep you engrossed and engaged for the entire run time. The sound effects are simply amazing and the movie ought to be watched with a good surround sound setup to fully enjoy the movie"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "sidbhanja",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Full Paisa wasool movie",
  "comment": ""
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "manmitsnehi-81252",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Stree review",
  "comment": "I usually don't write review ...more of the observer but this movie made me write a review for itself .....you can never ask for anything more beter from a Bollywood movie ...A perfect mixture of horror comedy and a amazing message at the end of the movie.\n\nThey have used some perfect Hindi idioms for humor which will make laugh like anything hats off director ..\n\nBest part of this movie you can watch it again and again without getting bored ...I have watched it yesterday but the urge of watching it again is still there"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "soumyaaflantese",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Lovely Watch.",
  "comment": "If you are willing to watch a very intelligently written movie which makes you laugh, scares you and yet subtly provides you with a great social message, then Stree is the movie for you.\n\nAny film which has a woman stepping out at night with her man inside the house, for 'his own safety', well, clap, clap, clap."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "imajaydw",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Vikky please",
  "comment": "Bollywood realease some movies in a year which can be watched without getting bore this is one of the 2018 movie I watched without cutting nice drama. And Nazar na lag jaye Sanu thaught ye ghabraye sanu.... Keep making these movies"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "as-16691",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Superhit",
  "comment": "What a movie... fantastic...u will not feel boring for a single minute.....every one must watch...."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "dhimaanb",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Thrilling",
  "comment": "A complete mixture of Horror and Comedy. The film gives the experience of some catchy comedy and frequent horror thrills. The audience would go crazy for sure. For me it's a Must Watch"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "maulin5",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Horror Comedy + Rajkumar Rao + Thought + Entertainment",
  "comment": "The year 2018 is the best year for releasing new genre film in Bollywood. This Friday, three films had released in Gujarat, in which this Horror-Comedy film Stree is the best watch. \n\nDirected by Amar Kaushik, it is produced by Dinesh Vijan and Raj-Dk. While, Raj & DK are writers of it. Starring Rajkumar Rao, Shraddha Kapoor, Aparshakti Khurrana & Pankaj Tripathi, Stree stands out as a winner. \n\nStree is based on the Indian urban legend, Nale Ba(don't come here) & Repu Ra (come back tomorrow). In the film, the story is about Chanderi and its ghost called Stree. She comes every year during the Pooja festival to take the revenge of her death and unsatisfied desires. So, these four nights are crucial for the people of Chanderi, as Stree attacks on men and takes them with her. The most common method to keep a Stree at bay, is to write a chant on the walls of the house, saying, \"O Stree, Kal Aana\", which roughly translates to asking the spirit to come tomorrow, and when she does, she reads the chant again, making it a never-ending process. A house without this chant on its walls, has its men in danger as the spirit will definitely come for them. Who is this stree? What is her purpose? Why is she doing this? And what experiences have been faced by Rajkumar and others are the questions which have been answered in the film.\n\nWhat can one say about Rao's performance! I mean, in every movie, he is going as strong as he can. And we are facing shortage of words describing him and his craft. Aparshakti and Pankaj Tripathi are as usual best. They will make sure that you will laugh out loud when they act. There is a cameo of Vijay Raaz as well. Shraddha is looking superb in the film. What is she playing, that I'm not gonna answer here!\n\nDialogues are fabulous. They're like cherry on the cake. Because there are some cuss words which have been mute, but then you can get it too. And which add the reality of characters in scary situation, like at the palace where Stree lives in. There you must have not behaved like a decent person. Kudos to the writers, from bringing a film based on this type of modern folklore. I am already impressed with them from Go Goa Gone itself. This is going to be a sure hit, will be remembered as a good film in their kitty. Though, the bus scene in the end brings out so many questions in my mind, will surely discuss with anyone about it. Or if possible, I would like to ask Raj & DK about it. \n\nMusic department is good. Though, the songs are not pushing the story ahead. That's why no songs in second half. Aao Haveli Pe suits perfectly. Kamariya and Dil Ka Darzi are watchable in the film. I have read some reviews saying that songs are minus point. But, hello, there are not a single whole song. 2 min song in between scenes, that too like there are just 3 songs, is fair enough.\n\nThis is the first movie of Amar Kaushik. After the so called struggle of 12 years, I'm happy for you that you made this film! Apart from horror and comedy, there are many scenes which tell the thought behind making this, or what to gain from this one. Especially, the last scene or the scene where men are so frightened by Stree that they're roaming in the city wearing saree, or staying at home. The reverse effect- I liked this scene so so much. The world is men dominating, but Stree should not be taken granted. Whatever upgrade versions we get for our gadgets, if our mindsets are not updating, we will become dinosaur soon.\n\nKudos to the whole team of Stree. Must watch. Scary, funny, thought provoking and the best part - Entertaining!"
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "srivastava-43550",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "One time watch.",
  "comment": "The comedy scenes portraited by Rajkumar Rao are awesome. One can definitely pay to watch this movie for a light hearted comedic 2 hours with a little suspense and horror."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "lokesh-kaushik",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Only One Word. OUTSTANDING!!!",
  "comment": "What a Movie! \n\nAfter long time, I watched such a great movie which is full of Comedy, drama, Horror & finest acting accompanied by awesome songs."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "subhankarsingha",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Awesome Fun + Horror Movie",
  "comment": ""
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "prafullasrivastav",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Deadly combo of Comedy and Horror with Paisa Vasool performances",
  "comment": "Direction: Debutant Direction Amar Kaushik selected perfect ground to play with combo of Comedy and Horror. First half was little bit dull however he showcased his skill in the second half with total grip on script. Camera works also added more horror inside the mind of the audience. \n\nPerformance: Rajkummar Rao did again heart winning performance of innocent guy from small town. Once again Outstanding performance by Pankaj Tripathi as he simply act in while speaking, walking and sitting. Shraddha Kapoor is good with her cute look. Aparshakti Khurrana , Abhishek Banerjee and Atul Srivastava have done brilliant job in Supporting role. Good Cameo from Vijay Raj.\n\nScript: For wonderful story, credit goes to producer duo Raj Nidimoru and Krishna D.K. One Good thing about this movie is that every moment in the cinema hall either you are crying or laughing. Climax has suspense with great message to the society.\n\nDialogues: Sumit Arora has written terrific and witty dialogues for Horror Comedy movie. e.g.Wo hum sab logo ke naam kaise janti hain.. uske pass tum sabka aadhar link hain (Translate: How come she know our names. Your Aadhar Card is linked with her).Conversation between RajKummar Rao and Atul Srivastava on Oorja was quite funny Some of the dialogues were double meaning.\n\nMusic: This is the only section where we can see some scope for improvement. Sachin-Jigar has composed 4 songs where 2 item songs. However brilliant job done by Ketan Sodha in Background score.\n\nBox-office:\n\nAs Yamla Pagla Deewana Phir se is also released with Stree, it means mouth of word will pull the crowd for this movie. Life time Box-office collection surely more than range of 50-60 crores.\n\nLast Words:\n\nIf you are bored with regular comedy movie, try this new combo in the cinema hall."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "gssaini-87682",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Nice!!",
  "comment": "Such a nice movie..fantastic and natual performance by all characters.."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "arngupta-23729",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Full on comedy & Horror",
  "comment": "It's amazing movie every time you scare & hahaha.. Golmaal again k Baad itna hasa Hun Mai..."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "vinay-32865",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Ridiculously Horror-Comedy Mashup Works",
  "comment": "First of all hats off to the Director Amar Kaushik for such bringing such concept. Perfect Casting. Rajkumar Rao & Pankaj Tripathi- Terrific as always. They make your scream with Laughter Aparshakti & Abhishek - delivers a fine performance. and Shraddha Kapoor- amazing and surprising.\n\nI can assure you that you will not take your eyes off the screen or you will not get bored during full movie. Movies is full of Humor, horror and social message too. Go and watch with your family"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "kpratheeks",
  "helpfulness": "1 out of 2 found this helpful",
  "title": "Best in Bollywood",
  "comment": "It's a full package of Horror and Comedy. A must watch movie \n\nRajkumar Rao blows out your mind with his acting. Could say the best Horror-comedy movie in Bollywood. Nowhere it feels like over or under acting, each character carried their attitude from the beginning and the same matches their role in the second half..so the character and their actions are syncing well\n\nBit of Critic: The music and song inbetween the Thrilling sceans in first half was irritating (Better we limit songs in such a story oriented movies)"
}, {
  "rated": "1",
  "out_of": "10",
  "userid": "vinodbisht-05370",
  "helpfulness": "6 out of 31 found this helpful",
  "title": "Stree so boring",
  "comment": ""
}, {
  "rated": "3",
  "out_of": "10",
  "userid": "rahulkala-86648",
  "helpfulness": "1 out of 3 found this helpful",
  "title": "Incoherent",
  "comment": "Rajkumar Rao , Aparshakti, Abhishek Bannerjee are good. Pankaj Tripathi is ok. Shraddha is bad. Setting of the small town is good. The topic had potential but storyline and presentation was average. If you are telling the story of a town terrorised by some entity, you need to include more small characters and their storylines. The movie first half focuses too much on the romance of Shraddha and Rajmumar which is a waste. Street takes handful of village men but only the four leads trying to stop her is itself ridiculous. Il suggest a re-watch of old Jaani Dushman."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "mhmdnazam",
  "helpfulness": "1 out of 3 found this helpful",
  "title": "Good, but not worthy of an 8.4",
  "comment": "Okay, it was a good movie, but not like it deserved an 8.4. I mean movies like gangs of Newyork got 7.6, Dill se got to 8.2, raanjhanaa got 7.6. And this movie is compared to Django unchained which also has a rating of 8.4. Sorry but its not as good Django unchained."
}, {
  "rated": "4",
  "out_of": "10",
  "userid": "pawan-tiwari",
  "helpfulness": "1 out of 3 found this helpful",
  "title": "An average fiasco.",
  "comment": "The whole movie is a kind of mess with an idea of message delivery, acting, casting, cinema plot, and almost everything. The story is not strong, neither the music or scenes. It was said to be a horror comedy whereas it is neither a good kind of any. Movie seemed to be made in hurry to achieve the target or something but not an entertaining. I wont suggest to waist hard earned money and watch only if sponsored :P"
}, {
  "rated": "5",
  "out_of": "10",
  "userid": "chintan-92627",
  "helpfulness": "1 out of 3 found this helpful",
  "title": "Nice attempt",
  "comment": "Nice attempt to a main streem horror movie but could had been better like bhul bhuliya had it gor better screenplay amd written in depth felt like an incomplete script taken ahead half way"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "ravindra0592",
  "helpfulness": "1 out of 3 found this helpful",
  "title": "Best Horror Comedy Movie Ever",
  "comment": ""
}, {
  "rated": "4",
  "out_of": "10",
  "userid": "akshatg",
  "helpfulness": "2 out of 11 found this helpful",
  "title": "Ending was not good",
  "comment": "The starting is good, but ending and story could be better made"
}, {
  "rated": "4",
  "out_of": "10",
  "userid": "palehorse-02180",
  "helpfulness": "1 out of 4 found this helpful",
  "title": "Even Rajkimar Rao can't save this dud",
  "comment": "I went for Stree after reading positive reviews on the internet and I must say I was hugely disappointed. The humor was either forced or was double meaning, CGI effects were second rate and the element of intrigue was missing throughout. In all, it was the first time I didn't like a movie that has Rajkumar Rao in it."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "muvi-fan-73",
  "helpfulness": "1 out of 4 found this helpful",
  "title": "Decent only for first 25 minutes, rest goes downhill!",
  "comment": "I don't generally watch horror. When I first saw trailer of Stree I made up my mind to not watch the movie. As the movie was released all there that was is good reviews surrounding the movie. Even IMDb rating was touching nine. Most of the reviews highlighted described it kind of comedy more than horror. In short a kind of movie that would grab my attention. So I thought let's give it a try. As the movie started and moved deeper I thought my decision was right, so first half an hour got me going. After that came a scene where it was pictured the word kal of 'o stree kal aana' gets rubbed off. From that scene it goes all downhill. I am happy that I didn't spend my penny. Even you should do that.\n\nDirection, Screenplay, Cinematography: Average. Music: Average. Acting: Justified.\n\nFinal Verdict: Don't go with the reviewers or raters. It spoils your mood for a decent movie after 25 minutes. Skip this one."
}, {
  "rated": "3",
  "out_of": "10",
  "userid": "shonawannachat",
  "helpfulness": "1 out of 10 found this helpful",
  "title": "Overrated movie",
  "comment": "In the first half jokes n story had no proper sync and as far is story is concerned it is just as much as shown in the trailer what a waste of my time... Can I get my refund back?"
}, {
  "rated": "2",
  "out_of": "10",
  "userid": "paajisunny",
  "helpfulness": "1 out of 10 found this helpful",
  "title": "Stree",
  "comment": ""
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "jain-anirudh",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Smart marketing and some lighthearted comedy. Not a great movie overall",
  "comment": "The best thing about Stree is the clever name given to the ghost as well as the movie itself. Indirectly referring to women in general while talking about the ghost, gives rise to most of the gender based humor that makes the movie entertaining. After a lot of slapstick gender jokes in the 1st half, the writer tries to give the story some direction/ purpose by building a backstory with the moral of gender equality/ women empowerment, which is probably the most clichéd in current Hindi cinema. Stree follows the general trap of Hindi movies of having a very light and slapstick 1st half which is focused on entertaining rather than carrying the story forward and then suddenly the 2nd half trying to build a purpose/ moral into the story and becoming a drag by trying to do too much, preach, and tie loose ends, all at the same time.\n\nThe weakest point of the movie is definitely the stone cold performance of the lead actor. All Shraddha Kapoor can manage is to look pretty and give blank expressions in all scenes. Good performances from Rajkummar Rao, Pankaj Tripathi, and other supporting actors save the movie to some extent but one can't help wonder how much better it could have been with someone of the acting caliber of Alia Bhatt or Vidya Balan in the lead role and a much better story with some twists and turns in the storyline or at least in the identity of the ghost itself..."
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "mohitlalwani-32967",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Stree Is The Best Movie",
  "comment": "This Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This MovieThis Movie IS Very Good And I Also Like This Movie"
}, {
  "rated": "2",
  "out_of": "10",
  "userid": "nikhilkishoremails",
  "helpfulness": "0 out of 2 found this helpful",
  "title": "Tatti",
  "comment": "A simple piece of garbage is called Stree. Watch at ur own risk with a packet of saridon."
}, {
  "rated": "1",
  "out_of": "10",
  "userid": "rajyadav-24660",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Aaaahh",
  "comment": ""
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "niteshventura",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Ok ok",
  "comment": ""
}, {
  "rated": "5",
  "out_of": "10",
  "userid": "shardulvgoel",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "A so-so movie: Stree",
  "comment": "Stree a ghost movie but also a comedy containing one........ Not too good but also it's not the worst one. Rajkumar Rao's acting is always wonderful. Story is not that great one. Overall this movie is decent.... Skills of actors are also good. But there is a somewhere a weakness of direction and plot."
}, {
  "rated": "1",
  "out_of": "10",
  "userid": "kk-adroit",
  "helpfulness": "0 out of 2 found this helpful",
  "title": "Not only waste of time; it deserves worst movie award too!",
  "comment": "This movie at its best is a uselessly coomposed art work. Rao has again done a good job portraiting a typical flippant north indian young man (after Newton) but it is neither going to add value to himself nor to the society. The movie doesn't have head or tail. Why should someone waste so much of effort on a futile idea that is so absurd. On top of that more than six thousand people have given it an imdb rating of greater than 8! It shows where the society is heading to! All the raters are indians; that too speaks of something which better be left un-commented! If you are a sensical person, stay assured, this movie will give you a sick headache. There surely are more interesting and better ways of wasting your time but don't go to watch this movie! It simply doesn't deserve that attention."
}, {
  "rated": "1",
  "out_of": "10",
  "userid": "royalrafe",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "boaring",
  "comment": "Boaringboaringboaringboaringboaringboariboaringboaringboaringboaringboaringboaringboaringboaringboaringboaringngboaring"
}, {
  "rated": "5",
  "out_of": "10",
  "userid": "eatit007",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "If only kapoor girl was not in this film I would've given it 7.",
  "comment": "Her acting is lame compared to acts by other. water over work of others."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "pawarsanket-27057",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "avarage horror and comedy movie",
  "comment": "Nice starring and actor plaing role....nice screenplay"
}, {
  "rated": "1",
  "out_of": "10",
  "userid": "balramchandra-51149",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Over acting",
  "comment": "Bakawas movie hai. Sabhi over acting karte hai 😬😬😣😣"
}, {
  "rated": "3",
  "out_of": "10",
  "userid": "chiragkarangia",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Just watch the trailer and save money!",
  "comment": "\n\n\n\n\n\n\n\n"
}, {
  "rated": "3",
  "out_of": "10",
  "userid": "dhruv_chawla-38701",
  "helpfulness": "0 out of 2 found this helpful",
  "title": "Horrible and not worth movie!",
  "comment": "With no storyline...songs...i have given3 here for only effects and acting...very dissaponted ..."
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "manumanojkiran",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "It's a routine ghost and some comedy.",
  "comment": "You can watch this for 150,or 200 that's all but don't watch buy spending 400, 700 rupees pls. There is no matter in but songs is nice over all."
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "ankitwilliams",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "One time watching",
  "comment": "An entertaining one time watch with a loose ending."
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "yogendrayp",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Just good.",
  "comment": "The movie is average not too good.it has not too much good scenes. And story hasn't too much suspense"
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "rahularyan487",
  "helpfulness": "0 out of 3 found this helpful",
  "title": "OVERRATED...",
  "comment": "Pankaj tripathi and ayush man khurana played done very well.. story nd direction weak.."
}, {
  "rated": "",
  "out_of": "",
  "userid": "sm-71120",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "A movie that will be remembered by all for a long time",
  "comment": "This movie has proven that if their are right actors at right place with their best ,it doesnt require money to get famous the movie then starts earning peoples attention on its own It is one of the best bollycomic after a long long time And will be a benchmarks for further movie to come"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "deft_vivek",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Nice movie with unique texture",
  "comment": "The movie holds audience with black comedy and a bit of horror till the end. And the movie candidly ends with a positive mesaage."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "shahkhan-22435",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Excellent movie",
  "comment": "Great movie after a long time.. script picturization everything perfect abt this movie"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "suniljangid",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Superb horror comedy",
  "comment": ""
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "prakharfriends",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Perfect combination of Horror and humour",
  "comment": "Yes, as I said this movie is the perfect combination of Horror and humour. all characters perform very well specially Rajkumar Rao (once again proved himself and entertain public with his acting skills). In fact, this is the first Bollywood horror movie I liked so much."
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "abhineet150",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "A must movie to watch.Rajkumar Rao delivers Yet again.",
  "comment": "A must movie to watch. A game changer in n Bollywood Industry. Rajkumar Rao is my Fav and he never disappoints with his acting.Hats off.\n\nOther supporting actors are commendable and done a good job.\n\nLast but not the least even the songs are good and something different.Not the usual copying and mixing up the old songs. Bollywood needs to stop remixing the old songs"
}, {
  "rated": "9",
  "out_of": "10",
  "userid": "drmayankkesharwani",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Terrific movie.....a must watch !!!",
  "comment": "...its a different kind of movie.....Rajkumar Rao , Aparshakti kburana n pankaj tripathi were just too good !! Overall ...its a refreshing movie !! Must watch"
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "chandanbharadwaj-83828",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Very funny",
  "comment": "Full of funny (scary) scenes. Full on entertainment."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "excursion-hcl",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Stree is a genuine entertainer.",
  "comment": "I watched this movie twice in a single day. It has a ridiculously interesting concept with good treatment. And that's make this movie a true entertainer. So reviews here. It's a story about a city, Chanderi. This city is in MP state of India. Once every year a season comes when a witch named 'stree' visits the city for 4 days and hunts the men in the city. Takes them away with her leaving only the clothes of the men. That's an interesting concept, a bit outdated but then, the director's execution makes it fresh dish. Vicky (Raj Kumar Rao) is a ladies tailor in the city. He has ability to take women's measurements by just looking at them. He meets Shraddha Kapoor on the first day of arrival of stree on the city. He falls in love with her, in between one of Vicky's friend Janna ( Abhishek Bannerjee) disappears under stree's hunt. Another friend of Vicky, Bittu ( Aparshakti Khurana) with a master of paranornal phenomenon, Rudra Ji (Pankaj Tripathi) goes in the wild to unfold the mystery of stree. Talking about the story. With the quality of movies and stories releasing in Bollywood, this one is much better than usual horror or comedy genres.Writers Raj & DK, that's what they like to call them. Unlike there previous stories, this has good turns and twists. Although there are few loopholes in the plot, but that's not important in understanding the movie. The suspense is present from the beginning about the stree, which is present till the end. Even after the movie finishes, one will be forced to think about the reality. That's the treatment that director Amar Kaushik has maintained in the storyline. It has a lot and lot and lots of humour. Not comedy, humour. Blended with acting skills of Rajkumar Rao, Aparshakti Khurana, Pankaj Tripathi and Abhishek Bannerjee. The casting has been done brilliantly. Shraddha Kapoor is just as cute as hell. Although the director could have worked on her character like other actors character. The music score is done beautifully. And the horror scene looks realistic. It is, unlike typical Bollywood horror horrible flicks. Kudos to the editor for giving this movie a perfect duration of approximately 120 minutes. One won't feel bored at any point of time even after watching it twice. Songs are timed at perfect timing and supporting casts are good. Verdict. Just Go For It. It a fresh wave in the mainstream Indian cinema. I am Damm sure you will enjoy this as a light horror-comedy flick."
}, {
  "rated": "7",
  "out_of": "10",
  "userid": "sarmabarnali",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Background score is the winner.",
  "comment": "Who is this 'Stree'? What does she want? Where does she lives ( or deads :p) ? Well you need to watch the movie to know answers(most of it).The movie takes you to a scary yet funny ride,and it manages to convey the social message without disturbing the storyline.Yes,there are few mistakes,in the plot,audience can uncover them,after watching the movie,but,while watching you will be entertained by their act."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "sankubhai-sharma",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Best watch for a group of friends.",
  "comment": "Horror comedy genre. You'll enjoy for sure. Everyone did justice to their characters."
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "tanyareddy-81271",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "loved it!",
  "comment": "Best movie i saw in a while! Great comic horror plot, great acting, nothing to complain about."
}, {
  "rated": "8",
  "out_of": "10",
  "userid": "thunderbuddies",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Scarier than many horror movies of India yet funny at the same time",
  "comment": "\n\n\n\n\n\n"
}, {
  "rated": "10",
  "out_of": "10",
  "userid": "lalitkmr",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Mind-blowing",
  "comment": "Watched it on Saturday. Had enjoyed it a lot. Rajkumar rao and pankaj Tripathi are just awesome. The others have also acted very well. A must watch movie. Go and watch it"
}, {
  "rated": "6",
  "out_of": "10",
  "userid": "sunildaswaney",
  "helpfulness": "0 out of 1 found this helpful",
  "title": "Good movie",
  "comment": "\"Stree\"is a good horror cum comedy with lovely performances by everyone especially Rajkumar Rao,his two friends and Pankaj Tripathi who's an absolute natural when it comes to acting.As always the songs in the movie were totally unnecessary,but i guess to ensure that the picture stands a good chance of making money,this nonsense is needed.The movie could have been edited a bit better as at 145 minutes ,the movie was about 15-25 minutes too long.All in all a pleasant watch"
}]